{
  "metadata": {
    "id": "doc_1745863637852_291",
    "filename": "537167_Contract - 31895 Part 2.pdf",
    "uploadDate": "2025-04-28T18:07:18.670Z",
    "fileType": "pdf",
    "wordCount": 21483,
    "tokenCount": 37009,
    "chunked": false,
    "totalChunks": 1,
    "hasEmbeddings": true,
    "hasExtractedText": false
  },
  "content": {
    "summary": "This is a Pennsylvania Department of Transportation highway construction contract (ECMS 31895) for a design-build project involving multiple utilities, railroad coordination, environmental commitments, and complex construction and design activities. The contract includes detailed provisions on DBE participation, erosion control, insurance requirements, utility coordination, railroad protective services, dynamic pile load testing, and quality assurance processes. Strict timelines and liquidated damages apply for traffic lane openings and ramp reconstructions. The contract mandates a comprehensive Quality Plan and compliance with Right-to-Know Law. Risks include financial penalties for delays, legal risks from compliance failures, and performance risks related to utility and railroad coordination. Critical clauses emphasize DBE substitution approvals, liquidated damages, design firm eligibility, RTKL compliance, and quality control.",
    "contentPreview": "ECMS Highway Construction Contract 31895\r\nJanuary 9, 2020 08:37:55 AMPage 51 of 319\r\nGood Faith Effort Review. The Department will review the GFE documentation for substitution. If, during the review of the Contractor’s GFE \r\ninformation, the reviewers have questions, the Contractor may be contacted for clarification. The GFE steps are as follows:\r\na.Contract Awards reviews and, if acceptable, approves the GFE and DBE revision or recommends that the IRT made the determination.\r\nb.The IRT either\r..."
  },
  "analysis": {
    "wordCount": 21483,
    "tokenCount": 37009,
    "filename": "537167_Contract - 31895 Part 2.pdf",
    "content": "ECMS Highway Construction Contract 31895\r\nJanuary 9, 2020 08:37:55 AMPage 51 of 319\r\nGood Faith Effort Review. The Department will review the GFE documentation for substitution. If, during the review of the Contractor’s GFE \r\ninformation, the reviewers have questions, the Contractor may be contacted for clarification. The GFE steps are as follows:\r\na.Contract Awards reviews and, if acceptable, approves the GFE and DBE revision or recommends that the IRT made the determination.\r\nb.The IRT either\r\n•Approves recommendation that the GFE was met and the Minority Participations substitution will be approved, or\r\n•Disapproves the GFE resulting in a shortfall requiring the contractor to continue GFEs.\r\nc.If forwarded to them, the IRT makes a final determination.\r\nDo not perform any of the DBE work included in the substitution request without prior approval from the Department.\r\nIf the projected DBE participation on an approved DBE Minority Participation and Commitment meets or exceeds the DBE goal amount for the contract \r\nwithout replacing the DBE, then no contract shortfall exists. A Revised DBE Minority Participation and Commitment and/or subcontractor approval request \r\nmust be submitted to reflect the decreased dollar amount.\r\n2.If the arrangement to be replaced is not agreeable between the Contractor and the DBE, the following procedures are required:\r\n•Until a determination is made, do not perform the DBE work without prior approval.\r\n•The IRT will review and make a determination and the District will notify both the Contractor and the DBE.\r\n•The Contractor or the DBE may request a meeting with the Department by contacting the District Office.\r\ne.SBE Participation. SBE Firms are not to commence work until they are approved. The SBE, including those business types other than subcontractor \r\n(i.e. supplier, trucking, service provider), must be submitted for subcontractor approval after the contract is executed and approved before the SBEs \r\nactual performance of work.\r\nf.Additional Work. When additional work is required for any classification of work which is identified on the DBE Minority Participation and \r\nCommitment to be performed by the DBE, at least 50% of this additional work will be performed by the same DBE unless the DBE submits, in writing, \r\nthat it cannot perform the work due to its own limitations.\r\ng.Progress Payments. Make payments in accordance with Section 110.05. Enter DBE and SBE progress payments into ECMS monthly. Bring to the \r\nattention of the Department, in writing, any situation in which regularly scheduled progress payments are not made to DBE/SBE subcontractors, \r\nsuppliers, service provider or consultant.\r\nh.Records and Reports. Keep such project records as are necessary to determine compliance with DBE Requirements. These records can be used as \r\nGFE documentation. Design these records to indicate:\r\n•The number of disadvantaged and non-disadvantaged subcontractors, small businesses, regular dealers, manufacturers, consultants, and service \r\nproviders, and the type of work or services performed on or materials incorporated in this project.\r\n•The progress and efforts made in seeking out DBE and SBE contractor organizations and individual DBEs and SBEs for work on this project.\r\n•Documentation of all correspondence, personal contacts, telephone calls, etc., to obtain the services of DBEs and SBEs for this project. Submit reports, \r\nas required by the Department. Certify that the amounts were actually paid to the DBE and SBE for work performed on the project and keep cancelled \r\nchecks on file in the home office to reflect payment for the specific project and for inspection and audit by the Department. Enter the pament \r\ninformation in ECMS “DBE Payments” within 5 business days after the end of the month and include the following:\r\n•The number of contracts awarded to DBEs and SBEs, noting the type of work and amount of each contract executed with each firm and including the \r\nexecution date of each contract.\r\n•The amount paid to each DBE and SBE during the month and the amount paid to date. If no payments are made to a DBE/SBE during the month, enter \r\na zero ($0.00) payment.\r\n•Paid invoices or a certification attesting to the actual amount paid to each firm, upon completion of the individual DBE's and SBEs work. In the event \r\nthe actual amount paid is less than the award amount, provide a complete explanation of the difference.\r\nMaintain all such records for a period of three (3) years following acceptance of final payment. Make these records available for inspection by the Department \r\nand FHWA.\r\n----------------Page (0) Break----------------\r\nECMS Highway Construction Contract 31895\r\nJanuary 9, 2020 08:37:55 AMPage 52 of 319\r\nIf DBE credit is being claimed for material costs included in a DBE subcontract or agreement, submit purchase orders for the material to the Inspector-in-\r\nCharge on a monthly basis.\r\n \r\nC87A - a00087 Changes to Specifications: Section 107\r\nAddendum:1\r\nAssociated Item(s):\r\n \r\nHeader:\r\nChanges to Specifications: Section 107\r\n \r\nProvision Body:\r\nSECTION 107—LEGAL RELATIONS AND RESPONSIBILITY TO THE PUBLIC\r\n•Section 107.28 Erosion and Sediment Pollution Control Plans and Permits. Revise first paragraph to read as follows:\r\n107.28 EROSION AND SEDIMENT POLLUTION CONTROL PLANS AND PERMITS—Install and maintain erosion and sediment \r\n(E&S) pollution control devices as indicated or submit an alternate plan for accomplishing equal or better temporary and permanent erosion and \r\nwater pollution control. If an alternate plan is submitted, do not start work until the plan is approved by the County Conservation District and \r\nthe Department. If a National Pollutant Discharge Elimination System (NPDES) Permit is involved, do not start work until the plan is approved \r\nby the DEP or the authorized County Conservation District and the Department. Concrete clean out areas, either contractor designed or \r\nindicated within the contract documents, are incidental to the contract items.\r\n \r\nG101H - a00101 GOVERNING SPECIFICATIONS AND APPLICABLE DESIGNATED SPECIAL \r\nPROVISIONS\r\nAddendum:\r\nAssociated Item(s):\r\n \r\nHeader:\r\nGOVERNING SPECIFICATIONS AND APPLICABLE DESIGNATED SPECIAL PROVISIONS\r\n \r\nProvision Body:\r\nI. GOVERNING SPECIFICATIONS. This bid proposal is made under, subject to, and governed by:\r\nSpecifications 408/2016, Change No. 7, effective date October 4, 2019 of the Pennsylvania Department of Transportation. Within \r\nthese Specifications where dual measurement and tabular options are presented English standards apply.\r\nII. APPLICABLE DESIGNATED SPECIAL PROVISIONS. The following Designated Special Provisions are found in Appendix C to \r\nthe above Governing Specifications. Those that apply to this bid proposal are preceded with a check (i.e., \"X\"). Goals, minimum \r\nlevels of participation, or other project specific requirements associated with these documents are also established where \r\napplicable:\r\n(x) DSP1. Offset Provision for State Contracts.\r\n(x) DSP2. Contractor Responsibility Provisions.\r\n(x) DSP3. Provisions for State Contracts Concerning the Americans with Disabilities Act.\r\n(__) DSP4. Diverse Business (DB) Requirements for Non-Federally Funded Construction Projects.\r\n----------------Page (1) Break----------------\r\nECMS Highway Construction Contract 31895\r\nJanuary 9, 2020 08:37:55 AMPage 53 of 319\r\n(x) DSP7. Disadvantaged Business Enterprise (DBE) Requirements for Federally-Funded Construction Projects. In conjunction \r\nwith this contract a goal of 10% of the original contract amount has been established.\r\n(x) DSP8. F.A.R. - Required Contract Provisions Federal-Aid Construction Contracts FHWA-1273 (Revised May 1, 2012). Also \r\nattached to the Proposal/Contract.\r\n(x) DSP9. Special Supplement - Anti-Pollution Measures - August 26, 1999.\r\n(x) DSP10. Nondiscrimination/Sexual Harassment Clause.\r\n(x) DSP11. Contractor Integrity Provisions.\r\n(x) DSP12. Executive Order 11246, with Appendix A and B.\r\n(x) DSP13. Buy America.\r\n(x) DSP14. Enhanced Minimum Wage Provisions.\r\n \r\nG113B - a00113 CONTRACT PROVISIONS - RIGHT-TO-KNOW LAW\r\nAddendum:\r\nAssociated Item(s):\r\n \r\nHeader:\r\nCONTRACT PROVISIONS - RIGHT TO KNOW LAW\r\n \r\nProvision Body:\r\nI. Contract Provisions – Right to Know Law 8-K-1532\r\na. The Pennsylvania Right-to-Know Law (RTKL), 65 P. S .  §§ 67.101-3104, applies to this Contract.\r\nb. If the Department needs assistance in any matter arising out of the RTKL related to this Contract, the Department will notify the \r\nContractor using the legal contact information provided in this Contract. The Contractor, at any time, may designate a different \r\ncontact for such purpose upon reasonable prior written notice to the Department.\r\nc. Upon written notification from the Department that it requires assistance in responding to a request under the RTKL for \r\ninformation related to this Contract that may be in the Contractor’s possession, constituting, or alleged to constitute, a public record \r\nin accordance with the RTKL (“Requested Information”), the Contractor will:\r\n1. Provide the Department, within 10 calendar days after receipt of written notification, access to, and copies of, any document or \r\ninformation in the Contractor’s possession arising out of this Contract that the Department reasonably believes is Requested \r\nInformation and may be a public record under the RTKL; and\r\n2. Provide such other assistance as the Department may reasonably request, in order to comply with the RTKL with respect to this \r\nContract.\r\nd. If the Contractor considers the Requested Information to include a request for a Trade Secret or Confidential Proprietary \r\nInformation, as those terms are defined by the RTKL, or other information that the Contractor considers exempt from production \r\nunder the RTKL, notify the Department and provide, within 7 calendar days of receiving the written notification, a written statement \r\nsigned by a representative of the Contractor explaining why the requested material is exempt from public disclosure under the \r\nRTKL.\r\ne. The Department will rely upon the written statement from the Contractor in denying a RTKL request for the Requested \r\nInformation unless the Department determines that the Requested Information is clearly not protected from disclosure under the \r\n----------------Page (2) Break----------------\r\nECMS Highway Construction Contract 31895\r\nJanuary 9, 2020 08:37:55 AMPage 54 of 319\r\nRTKL. Should the Department determine that the Requested Information is clearly not exempt from disclosure, provide the \r\nRequested Information within 7 calendar days of receipt of written notification of the Department’s determination.\r\nf. Failing to provide the Requested Information within the time period required by these provisions, indemnify and hold the \r\nDepartment harmless for any damages, penalties, costs, detriment or harm that the Department may incur as a result of this \r\nfailure, including any statutory damages assessed against the Department.\r\ng. The Department will reimburse the Contractor for any costs associated with complying with these provisions only to the extent \r\nallowed under the fee schedule established by the Office of Open Records or as otherwise provided by the RTKL if the fee \r\nschedule is inapplicable.\r\nh. The Contractor may file a legal challenge to any Department decision to release a record to the public with the Office of Open \r\nRecords, or in the Pennsylvania Courts, however, indemnify the Department for any legal expenses incurred by the Department as \r\na result of such a challenge and hold the Department harmless for any damages, penalties, costs, detriment or harm that the \r\nDepartment may incur as a result of the failure, including any statutory damages assessed against the Department, regardless of \r\nthe outcome of such legal challenge. As between the parties, agree to waive all rights or remedies that may be available as a \r\nresult of the Department’s disclosure of Requested information pursuant to the RTKL.\r\ni. The Contractor’s duties relating to the RTKL are continuing duties that survive the expiration of this Contract and continue as \r\nlong as the Requested Information remains in the Contractor's possession.\r\n \r\nG201A - a00201 PRE-BID CONFERENCE\r\nAddendum:\r\nAssociated Item(s):\r\n \r\nHeader:\r\nPRE-BID CONFERENCE\r\n \r\nProvision Body:\r\nA pre-bidding conference will be held with Department of Transportation personnel and all prospective bidders and other interested \r\nparties to discuss this project.\r\nThe meeting will take place on October 24, 2019 at 9:30 AM Local Time, at the Engineering District 12-0 Office. Address: 825 \r\nN. Gallatin Ave. Ext, P. O .  Box 459, Uniontown PA 15401\r\nIn compliance with the Americans with Disabilities Act of 1990, the Department has scheduled the pre-bid conference at a facility \r\nwhich is accessible to persons having disabilities.\r\nAny person having special needs or requiring special assistance is requested to contact Jeremy Shaneyfelt at 724.439.7321 by \r\nOctober 21, 2019, in order that special needs may be accommodated and/or assistance provided.\r\nDirect any questions regarding the pre-bid conference to Jeremy Shaneyfelt at 724.439.7321.\r\n \r\nG312A - a00312 Road Users Liquidated Damages (RULD)\r\nAddendum:\r\nAssociated Item(s):\r\n \r\nHeader:\r\nROAD USER LIQUIDATED DAMAGES (RULD)\r\n \r\nProvision Body:\r\n----------------Page (3) Break----------------\r\nECMS Highway Construction Contract 31895\r\nJanuary 9, 2020 08:37:55 AMPage 55 of 319\r\nRoad User Liquidated Damages (RULDs) will be assessed as specified in Section 108.07(b) and as follows:\r\nUnrestricted traffic is defined as opening the roadway/structure full width including shoulders and ramps as \r\napproved by the Representative with no further need for traffic restrictive devices.\r\n24 hours in advance of the completion of portions of the work which control the assessment of liquidated \r\ndamages, notify the Representative so that a mutual inspection can be performed. If the Representative \r\ndetermines that the work is completed satisfactorily, the travel lanes will be opened to unrestricted traffic and \r\nno further liquidated damages will be assessed for that portion of work.\r\nDamage charges as outlined below will be assessed independent of and concurrent with, as appropriate, \r\nConstruction Engineering Liquidated Damages (CELD) as specified in Section 108.07(a).\r\nRULDs as specified will be deducted from money due or to become due.\r\nMilestone Compliance\r\nSR 0070 is currently two lanes in each direction within the project limits. A single lane closure eastbound and \r\na single lane closure westbound are permitted for SR 0070 between 8:00 PM and 6:00 AM. RULDs of \r\n$1,000.00 per hour per direction will be assessed for each hour or portion of hour when two lanes of traffic in \r\neach direction on SR 0070 are not open to normal traffic flow prior to 8:00 PM and after 6:00 AM regardless \r\nof the day of the week. This restriction does not apply to momentarily stopping traffic to allow trucks in and \r\nout of the work areas.\r\nWhen SR 3010 (Wyano Road) traffic is detoured for the total reconstruction and structure repairs, it must be \r\nreopened for unrestricted traffic within 44 calendar days. If SR 3010 is not opened for unrestricted traffic \r\nwithin this time, the Contractor will be assessed RULDs in the amount of $1,000.00 per calendar day for \r\neach day or part of a calendar day after 44 calendar days that SR 3010 is not opened for unrestricted traffic.\r\nWhen the Yukon WB on ramp (SR 8030-Ramp D, innerloop E) is detoured for ramp construction it must be \r\nreopened for unrestricted traffic within 31 calendar days. If it is not opened for unrestricted traffic within this \r\ntime, the Contractor will be assessed RULDs in the amount of $1,000.00 per calendar day for each day or \r\npart of a calendar day after 31 calendar days that the Yukon WB on ramp is not opened for traffic.\r\nWhen the Yukon EB off ramp (SR 8030-Ramp C, innerloop B) is detoured for ramp construction, it must be \r\nreopened for unrestricted traffic within 18 calendar days. If it is not opened for unrestricted traffic within this \r\ntime, the Contractor will be assessed RULDs in the amount of $1,000.00 per calendar day for each day or \r\npart of a calendar day after 18 calendar days that the Yukon EB off ramp is not opened for traffic.\r\nWhen the Yukon WB off ramp (SR 8030-Ramp A, old Ramp E) is detoured for ramp construction, it must be \r\nreopened for unrestricted traffic within 47 calendar days. If it is not opened for unrestricted traffic within this \r\ntime, the Contractor will be assessed RULDs in the amount of $1,000.00 per calendar day for each day or \r\npart of a calendar day after 47 calendar days that Yukon WB off ramp is not opened for traffic.\r\nWhen the Madison WB on ramp (SR 8032-Ramp H, innerloop B) is detoured for ramp construction, it must \r\nbe reopened for unrestricted traffic within 26 calendar days. If it is not opened for unrestricted traffic within \r\nthis time, the Contractor will be assessed RULDs in the amount of $2,000.00 per calendar day for each day \r\nor part of a calendar day after 26 calendar days that the Madison WB on ramp is not opened for traffic.\r\nWhen the Phase 1E: Madison EB on ramp (SR 8032-Ramp F), Madison EB off ramp (SR 8032-Ramp G) \r\nand SR 3037 (Waltz Mill Road) are detoured for ramp construction, all must be reopened for unrestricted \r\ntraffic within 46 calendar days. If all are not opened for unrestricted traffic within this time, the Contractor will \r\nbe assessed RULDs in the amount of $10,000.00 per calendar day for each day or part of a calendar day \r\nafter 46 calendar days that the Madison EB on ramp, Madison EB off ramp, and SR 3037 are not opened for \r\ntraffic.\r\nWhen traffic on the Yukon and Madison EB on and off ramps (SR 8030 –Ramp B, SR 8030 –Ramp C, SR \r\n8032–Ramp F & SR 8032 –Ramp G) is detoured after the eastbound lanes area opened, all ramps must be \r\ncompleted for traffic within 40 calendar days. If the any ramp is not opened for traffic within this time, the \r\nContractor will be assessed RULDs in the amount as noted below for each day or part of a calendar day \r\nafter 40 calendar days that the ramp is not opened for traffic.\r\nSR 8030-Ramp B $2,000.00\r\n----------------Page (4) Break----------------\r\nECMS Highway Construction Contract 31895\r\nJanuary 9, 2020 08:37:55 AMPage 56 of 319\r\nSR 8030-Ramp C $2,000.00\r\nSR 8032-Ramp F $3,000.00\r\nSR 8032-Ramp G $3,000.00\r\nFour interruptions to the ITS communication link, each less than 4 hours will be allowed to complete the \r\nwork. If any one interruption exceeds 4 hours, or if more than four interruptions are required, liquidated \r\ndamages will be assessed in the amount of $500 per hour or part of an hour over the allowed duration for \r\nwhich the communications link is not operable\r\n \r\n00 - a01005 STEEL BEAM TEST PILES, HP12X74 GALVANIZEDSTEEL BEAM TEST PILES, HP12X84 \r\nGALVANIZED\r\nAddendum:\r\nAssociated Item(s):\r\n \r\nHeader:\r\nSTEEL BEAM TEST PILES, HP12X74 GALVANIZED\r\nSTEEL BEAM TEST PILES, HP12X84 GALVANIZED\r\n \r\nProvision Body:\r\nIn accordance with Section 1005 and as follows:\r\n1005.2 Material\r\nIn accordance with Section 1005.2 and as follows:\r\n•Galvanize the piles to ensure the top 15'-0\" of embedded length is galvanized.\r\n1105.02(s)2. Repair of Damaged Galvanizing. Revise as follows:\r\nAny galvanizing material that is damaged due to shipment, handling, splicing, welding or cutting, repair in accordance \r\nwith ASTM A 780/A 780M\r\n1005.4 Measurement and payment\r\nIn accordance with Section 1005.4 and as follows:\r\n• Cost of galvanizing is incidental to this item.\r\n• Repair of galvanizing material is incidental to this item.\r\n• A minimum of 15'-0\" beyond the estimated pile lengths is incidental to this item.\r\n \r\nG1601A - a01601 E.E.O. COVERED AREA\r\nAddendum:\r\nAssociated Item(s):\r\n \r\nHeader:\r\nE.E.O. COVERED AREA\r\n \r\nProvision Body:\r\nFor the purpose set forth in the Executive Order 11246\r\nthe covered area for this contract is Westmoreland County,\r\nwhich is within the Economic Area of Pittsburgh Pa\r\n----------------Page (5) Break----------------\r\nECMS Highway Construction Contract 31895\r\nJanuary 9, 2020 08:37:55 AMPage 57 of 319\r\nas listed in Appendix B of Designated Special Provision 12 (DSP12) entitled “Executive Order 11246 (with Appendix A and B)” in \r\nAppendix C of Pub 408.\r\n \r\nG1901B - a01901 INSURANCE--GENERAL APPLICATION\r\nAddendum:\r\nAssociated Item(s):\r\n \r\nHeader:\r\nINSURANCE--GENERAL APPLICATION\r\n \r\nProvision Body:\r\nI. Name, Address, Contact Person and Phone Number of the Railroad as found in the Project Specific Details,\r\nDetail 1(see below ).\r\nII. GENERAL.\r\n    (a) In addition to any other forms of insurance or bonds required under the terms of the contract and specifications, provide and \r\ncarry Railroad's Protective Public Liability Insurance in the specified amounts.  Also, submit a properly executed Insurance \r\nCertificate evidencing the issuance of adequate Contractor's Public Liability and Property Damage Insurance with the executed \r\ncontract when it is returned to the Department.\r\n    (b) Carry the specified insurance from the time physical work is started until all physical work required to be performed under the \r\nterms of the contract is substantially completed.  Failure to carry or keep such insurance in force until all work is substantially \r\ncompleted will constitute a violation of the contract and in such event, the Secretary may avail himself of the remedies provided \r\nunder Section 108.08.\r\n    (c) Furnish to the railroad company a signed copy of the policy for Contractor's Public Liability and Property Damage Insurance \r\nand the signed original policy for Railroad's Protective Public Liability Insurance prior to entry upon railroad right-of-way.  If any \r\nwork is subcontracted, also furnish to the railroad a signed copy of the policy for Contractor's Protective Public Liability and \r\nProperty Damage Insurance.\r\nIII.  RAILROAD'S PROTECTIVE PUBLIC LIABILITY INSURANCE.\r\nFurnish the Department evidence that, with respect to the operations the Contractor or any subcontractors perform, provide \r\nRailroad Protective Public Liability Insurance in the name of the Railroad found in the Project Specific Details, Detail 1  providing \r\ncoverage for bodily injury, death, and property damage limited to a combined single limit of not less than two million dollars \r\n($2,000,000) per occurrence with an aggregate limit of not less than six million dollars ($6,000,000) for the term of the policy.\r\nIV.  CONTRACTOR'S PUBLIC LIABILITY AND PROPERTY DAMAGE INSURANCE.\r\nIn accordance with Sections 103.06 and 107.14, carry regular Contractor's Public Liability and Property Damage Insurance of not \r\nless than two million dollars ($2,000,000).\r\nV.  CONTRACTOR'S PROTECTIVE PUBLIC LIABILITY AND PROPERTY DAMAGE\r\nIf any work is subcontracted, furnish evidence to the Department that regular Contractor's Protective Public Liability and Property \r\nDamage Insurance of not less than two million dollars ($2,000,000) is carried, in the Contractor's behalf.\r\n \r\nProject Specific Details:\r\nOmega Rail Management\r\nAndrea Couch\r\n4721 Trousdale Drive, Suite 206\r\n----------------Page (6) Break----------------\r\nECMS Highway Construction Contract 31895\r\nJanuary 9, 2020 08:37:55 AMPage 58 of 319\r\nNashville, TN. 37220\r\n(800) 990-1961\r\n \r\nG2201A - a02201 RAILROAD COMPANY CONTACT PERSON\r\nAddendum:\r\nAssociated Item(s):\r\n \r\nHeader:\r\nRAILROAD COMPANY CONTACT PERSON\r\n \r\nProvision Body:\r\nContact the following railroad company representative to request protective services required by the special provision entitled \r\n\"Maintenance and Protection of Railroad Traffic\":\r\nRailroad Protective Services:\r\nChris McCrum\r\nAssistant Manager, Track Maintenance\r\n519 Cedar Way, Bldg 1, Ste 100, Oakmont, PA 15139\r\n412-977-8279\r\n \r\nG2301A - a02301 MAINTENANCE AND PROTECTION OF RAILROAD TRAFFIC\r\nAddendum:\r\nAssociated Item(s):\r\n \r\nHeader:\r\nMAINTENANCE AND PROTECTION OF RAILROAD TRAFFIC\r\n \r\nProvision Body:\r\nI. Make the safety and operation continuity of the railroad company traffic of the first importance. At all times protect and safeguard \r\nsuch traffic and arrange project work accordingly. Whenever the work may affect the safety and movement of trains, submit the \r\nmethod of doing such work to the chief engineer of the railroad company or duly authorized representative for approval. Do not \r\nbegin or prosecute work without such approval. However, the approval of the railroad company's chief engineer or duly authorized \r\nrepresentative will not be considered as a release from responsibility for any damage to the railroad company by the acts of the \r\nContractor or those of his/her employees. Prepare and submit plans for approval to the railroad company's chief engineer for all \r\nwork, including, but not limited to, tunneling under tracks, sheeting, shoring, and erection in the vicinity of and over tracks.\r\nII. During the construction period, the railroad company and the Department will co-operate with each other in the protection of \r\ntheir respective traffic and in the construction as indicated. Give the chief engineer of any involved railroad fourteen (14) days \r\nwritten notice before any work is started on railroad property, in order that the necessary arrangements may be made to properly \r\nprotect railroad traffic.\r\nIII. The railroad company will provide all watchmen, operators, flagmen, clearance men, and similar protective services, considered \r\nby the railroad company's chief engineer or his duly authorized representative as necessary to insure the safety of trains \r\ncontingent upon the project's operations, at the sole expense of the Department. It is agreed, however, that providing of such \r\nwatchmen, and other precautions, will not relieve liability of payment for damage caused by project operations. The Department \r\nwill not be responsible for such damage.\r\n----------------Page (7) Break----------------\r\nECMS Highway Construction Contract 31895\r\nJanuary 9, 2020 08:37:55 AMPage 59 of 319\r\nIV. It is expressly understood that this contract includes no work for which the railroad company is to be billed. Therefore, do not bill \r\nthe railroad company for any work which may be performed unless the railroad company gives a written request that such work be \r\nperformed at its expense.\r\nV. The raising or surfacing of tracks due to any settlement, caused by the project operations will be performed by the railroad, but \r\nthe cost will be borne entirely by Contractor.\r\nVI. During construction a minimum overhead clearance of 6.7m(7m for electrical tracks) (22 feet (23 feet for electrical tracks)) \r\nabove the top of rail and a minimum horizontal clearance of 12 feet from centerline of tangent track will be permitted. If the \r\nclearances indicated are less than those stated above, then the lesser clearance will be permitted. In any case, this minimum side \r\nclearance applies to tangent track only. For curved track, provide additional minimum side clearance to compensate for curvature. \r\nContact the railroad company's chief engineer to ascertain the amount of additional minimum side clearance required. If at any \r\ntime during construction it is decided that project operations require overhead and/or side clearances less than the minimum stated \r\nor indicated submit a request to the railroad company's chief engineer as outlined above for safety and continuity of railroad \r\noperations. Deviate from those minimums stated above or indicated, only upon receipt of approval of such a request.\r\nVII. Do not work over any high tension wires or within 10 feet on each side and below such wires. When it is necessary to work or \r\nplace equipment within these limits, make arrangements with the railroad to furnish electrical clearance men and de-energize the \r\nwires contingent upon railroad operation. Where voltage exceeds 50,000 volts, increase this working clearance.\r\n \r\nG2401B - a02401 RAILROAD PROTECTIVE SERVICES COSTS\r\nAddendum:\r\nAssociated Item(s):\r\n \r\nHeader:\r\nRAILROAD PROTECTIVE SERVICES COSTS\r\n \r\nProvision Body:\r\nI. The Department will make payment to the railroad for all costs associated with watchmen, operators, flagmen, clearance men, \r\nand similar protective services provided by the railroad company based on railroad regulations and the Contractor's construction \r\nschedule.\r\nII. Actual costs will be assessed by the Department whenever protective services are provided by the railroad at the request of the \r\nContractor, but if such requested services are not utilized due to a change in the Contractor's construction schedule or if it is \r\ndetermined by the Department that the requested services were not necessary, the actual costs to be assessed by the Department \r\nagainst the Contractor will be the amount billed by the railroad to the Department.\r\nIII. It will be the Contractor's responsibility to obtain the protective services from the railroad and the Department assumes no \r\nliability for any delays caused by the failure of the Contractor to obtain such services in accordance with the railroad requirements.\r\nIV. The actual costs to be assessed above will be deducted from money due or that becomes due the Contractor.\r\n \r\nG4301D - a04301 UTILITIES--THE REQUIREMENT TO LIST INFORMATION\r\nAddendum:\r\nAssociated Item(s):\r\n \r\nHeader:\r\nUTILITIES--THE REQUIREMENT TO LIST INFORMATION\r\n \r\n----------------Page (8) Break----------------\r\nECMS Highway Construction Contract 31895\r\nJanuary 9, 2020 08:37:55 AMPage 60 of 319\r\nProvision Body:\r\nI. Cooperate with the public utility companies and local authorities in the placement, replacement, relocation, adjustment, or \r\nreconstruction of their structures and facilities during construction. Contact all utility representatives at least 15 calendar days \r\nbefore starting operations.\r\nPRIORAnticipated completion before the Notice to Proceed is issued. Use actual or \r\nanticipated completion date shown.\r\nRESTRICTIVETo be completed by the utility or string of utilities before operating without restriction. \r\nNumber of calendar days will start from the actual notice to proceed that is issued to \r\nthe contractor.\r\nCONCURRENTSimultaneous with, but not restricting, operations. Number of calendar days required.\r\nCOORDINATEDPhasing with specific construction operations. Number of calendar days required \r\nafter completion of specific construction operations.\r\nNOT AFFECTEDIdentifies utility with facilities in the construction area not anticipated to be affected. \r\nSpecific information may be provided by the utility.\r\nINCORPORATEDUtility relocation work to be incorporated into the prime highway construction \r\ncontract.\r\nCONDITIONAL RESTRICTIONS AND \r\nTIME REQUIREMENTS\r\nIdentify conditions affecting the utility's ability to perform a certain type of utility \r\nrelocation work, i. e., certain times of the day, week, or year that a facility cannot be \r\nshut down, acquisition of Right-of-Way by the state, or demolition of buildings.\r\nAny changes to the utility relocation work must be approved by PennDOT and have the utility concur. \r\nChanges made for the highway contractor’s convenience will be performed at the highway contractor’s \r\nexpense.\r\nSECTION L-10\r\nWEST PENN POWER\r\nContact: Brad Herrington, telephone: 724-626-6227, email: bherrin@firstenergycorp.com Construction \r\nContact: Same\r\nPRIOR: (AERIAL) SR 0070, Sta. 666+60 RT, Utility will replace pole #297062, 145’ RT, remove pole \r\n#297061 17’ LT and relocate pole #297060, 142’ LT\r\nPRIOR: (AERIAL) SR 0070, Sta. 697+35, 3’ LT, Relocate pole #900626 to Sta. 697+20, 93’ LT\r\n----------------Page (9) Break----------------\r\nECMS Highway Construction Contract 31895\r\nJanuary 9, 2020 08:37:55 AMPage 61 of 319\r\nPRIOR: (AERIAL) SR 0070, Sta. 697+70, 136’ RT. Replace pole #900627 with taller pole/cross arms and \r\nadd anchor/guy\r\nPRIOR: (AERIAL) SR 3010, Sta. 116+15, Relocate anchor/guy on pole #297065 at 47’ LT\r\nPRIOR: (AERIAL) SR 3010, Sta. 117+80, 20’ LT, Relocate pole #82439 to Sta. 117+80, 35’ LT\r\nPRIOR: (AERIAL) SR 3037, Sta. 32+85, 60’ LT, Utility to remove existing conductors, pole to be removed by \r\nLHTC\r\nPRIOR: (AERIAL) T-529, Sta. 41+25, 25’ RT, Utility to remove existing conductors, pole to be removed by \r\nLHTC, pole #900616\r\nPRIOR: (AERIAL) T-529, Sta. 42+10, 20’ RT, Utility to remove existing conductors, pole to be removed by \r\nLHTC, No pole number\r\nPRIOR: (AERIAL) T-529, Sta. 43+35, 8’ RT, Utility to remove existing conductors, pole to be removed by \r\nLHTC, pole #900613\r\nPRIOR: (AERIAL) T-529, Sta. 44+03, 2’ RT, Utility to remove existing conductors, pole to be removed by \r\nLHTC, pole #900614\r\nAnticipated completion December 31, 2019\r\nNOT AFFECTED: Poles at the following locations are within the project limits and will remain in place:\r\nSR 0070, Sta. 634+70 RT, WPP pole #368860\r\nSR 0070, Sta. 636+70 RT, WPP pole #368859\r\nSR 0070, Sta. 640+15 RT, WPP pole #368858\r\nSR 0070, Sta. 643+60 RT, WPP pole #368857\r\nSR 0070, Sta. 645+98 RT, WPP pole #368856\r\nSR 0070, Sta. 648+97 RT, WPP pole #368855\r\nSR 0070, Sta. 651+97 RT, WPP pole #368854\r\nSR 0070, Sta. 654+96 RT, WPP pole #368853\r\nSR 0070, Sta. 657+93 RT, WPP pole #368852\r\nSR 0070, Sta. 661+55 RT, WPP pole #323077\r\nSR 0070, Sta. 662+50 RT, WPP pole #1084857\r\nSR 0070, Sta. 664+47 RT, WPP pole #323067\r\nSR 0070, Sta. 671+25 RT, WPP pole #579258\r\nSR 3010, Sta. 113+30 LT, WPP pole #494673\r\nSR 3037, Sta. 17+43 RT, WPP pole #319249\r\n----------------Page (10) Break----------------\r\nECMS Highway Construction Contract 31895\r\nJanuary 9, 2020 08:37:55 AMPage 62 of 319\r\nSR 8032, Sta. 900+50 RT, WPP pole #319250\r\nSR 8032, Sta. 902+50 RT, WPP pole #1072646\r\nSR 8032, Sta. 903+85 RT, WPP pole #1072647\r\nDQE COMMUNICATIONS\r\nContact: Adam Nulph, telephone: 724-919-7258, email: ACNulph@dqe.com\r\nConstruction Contact: Same\r\nPRIOR (AERIAL) SR 0070, Sta. 697+35 crossing, Utility will relocate fiber optic to poles set by West Penn \r\nPower.\r\nUtility will begin their work once notified by West Penn Power that their work is complete.\r\nAnticipated completion for all is January 10, 2020\r\nCOMCAST\r\nContact: Brian Woller, telephone: 724-691-0614, email: brian_woller@cable.comcast.com\r\nConstruction Contact: Same\r\nPRIOR: (AERIAL) SR 0070, 697+35 - 697+70, crossing, Utility will relocate cable to poles set by West Penn \r\nPower.\r\nUtility will begin work once notified by DQE Communications that their work is complete.\r\nAnticipated completion is January 24, 2020\r\nCOORDINATED: (AERIAL) SR 0070, 719+80, 25’ LT, Contractor will remove trees and provide access to this \r\npole. Utility will attach cable to pole set by Laurel Highlands Telephone Company (LHTC) at Sta. 720+90, \r\n122’ LT. Two (2) calendar days required.\r\nUtility will begin work once notified by LHTC that their work is complete.\r\nLAUREL HIGHLANDS TELEPHONE COMPANY (LHTC)\r\nContact: Rocky Richter, telephone: 724-593-0125, email: rrichter@lhtc.net\r\nConstruction Contact: Same\r\nPRIOR: (AERIAL) SR 3014, Sta. 98+35, 17’ RT, Relocate pole #E-20 to Sta. 98+35, 22’ RT\r\nPRIOR: (UNDERGROUND) SR 3037, T-529 Sta. 40+25 RT to SR 3037 Sta. 35+80 LT/RT, Utility will \r\nabandon underground cables\r\nPRIOR: (AERIAL) RAMP A-D, Sta. 161+50, 131’ RT, Relocate pole #A-9 to Sta. 161+50, 136’ RT\r\nPRIOR: (AERIAL) RAMP A-D, Sta. 163+00, 37’ RT, Relocate pole #A-8 to Sta. 163+00, 42’ RT\r\nAnticipated completion is December 31, 2019\r\n----------------Page (11) Break----------------\r\nECMS Highway Construction Contract 31895\r\nJanuary 9, 2020 08:37:55 AMPage 63 of 319\r\nCOORDINATED: (AERIAL) SR 0070, Sta. 683+57, 125’ LT, Relocate pole #A-15 to Sta. 683+57, 155’ LT. \r\nTwo (2) calendar days required.\r\nCOORDINATED: (AERIAL) SR 0070, Sta. 685+47, 86’ LT, Relocate pole #A-16 to Sta. 685+47, 116’ LT. Two \r\n(2) calendar days required.\r\nCOORDINATED: (AERIAL) SR 0070, Sta. 686+82, 66’ LT, Relocate pole #A-17 to Sta. 686+82, 126’ LT. Two \r\n(2) calendar days required.\r\nCOORDINATED: (AERIAL) SR 0070, Sta. 719+80, 25’ LT, Relocate pole #E-14 to Sta. 720+90,\r\n122’ LT. Two (2) calendar days required.\r\nContractor will remove trees and provide access to these poles and notify utility ten (10) calendar days in \r\nadvance to schedule crew and materials.\r\nCOORDINATED: (AERIAL) SR 3010, Sta. 109+10, 15’ RT, Relocate pole #C-2 to Sta. 108+60, 15’ RT. Four \r\n(4) calendar days required.\r\nCOORDINATED: (AERIAL) SR 3010, Utility will install pole #C-2A at Sta. 108+60, 18’ LT and pole #C-3A \r\nSta. 111+40, 18’ LT and pull cable in conduit. Eight (8) calendar days required.\r\nCOORDINATED: (AERIAL) SR 3010, Sta. 111+50, 87’ LT, Pole #C-3B to be removed. One (1) calendar day \r\nrequired.\r\nCOORDINATED: (AERIAL) SR 3037, Sta. 32+85, 66’ LT, Utility to remove pole #A-35 once all other aerial \r\nutilities have transferred off pole. One (1) calendar day required.\r\nCOORDINATED: (AERIAL) SR 8032/Ramp E, Sta. 909+00, 99’ RT, Utility will replace existing pole #E-13 \r\nwith a taller pole at the same station and offset. Two (2) calendar days required.\r\nCOORDINATED: (AERIAL) T-529, Sta. 40+05, 27’ RT, Utility will remove pole #A-31 once\r\nall other utilities have transferred off pole. One (1) calendar day required.\r\nCOORDINATED: (AERIAL) T-529, Sta. 41+25, 25’ RT, Utility will remove pole #A-32\r\nonce all other utilities have transferred off pole. One (1) calendar day required.\r\nCOORDINATED: (AERIAL) T-529, Sta. 42+10, 20’ RT, Utility will remove pole #A-33 once all\r\nother utilities have transferred off pole. One (1) calendar day required.\r\nCOORDINATED: (AERIAL) T-529, Sta. 43+35, 8’ RT, Utility will remove pole #A-34 once all\r\nother utilities have transferred off the pole. One (1) calendar day required.\r\nCOORDINATED: (AERIAL) T-529, Sta. 44+03, 2’ RT, Utility will remove pole #A-34A once all other utilities \r\nhave transferred off the pole. One (1) calendar day required.\r\nContractor will give 10 calendar day notification when poles are clear, and conduit is installed.\r\nNOT AFFECTED: Poles at the following locations are within the project limits and\r\nwill remain in place.\r\n----------------Page (12) Break----------------\r\nECMS Highway Construction Contract 31895\r\nJanuary 9, 2020 08:37:55 AMPage 64 of 319\r\nSR 0070, Sta. 682+10, 170’ LT, LHTC pole #A-14\r\nSR 3010, Sta. 111+60, 15’ RT, LHTC pole #C-3 SR 3010, Sta. 112+98, 27’ RT, LHTC pole #C-4\r\nSR 3010, Sta. 114+28, 27’ RT, LHTC pole #C-5\r\nSR 3010, Sta. 114+28, 34’ RT, LHTC pole #C-5A\r\nSR 3010, Sta. 116+17, 25’ RT, LHTC pole #C-6\r\nSR 3014, Sta. 95+65, 145’ RT, LHTC pole #E-18\r\nSR 3014, Sta. 96+80, 59’ RT, LHTC pole #E-19\r\nSR 3014, Sta. 100+05, 12’ RT, LHTC pole #E-21\r\nSR 3037, Sta. 34+35, 35’ LT, LHTC pole #A-36\r\nSR 3037, Sta. 36+10, 33’ LT, LHTC pole #A-37\r\nSR 8032/Ramp E, Sta. 908+00, 165’ RT, LHTC pole #E-12\r\nPEOPLES GAS\r\nContact: Gary Baird, telephone: 724-837-1057 ext. 104, email: gbaird@lsse.com\r\nConstruction Contact: Dave Harhai, telephone: 724-600-7408, email: David.Harhai@peoples-gas.com\r\nCOORDINATED: (UNDERGROUND) SR 0070, Sta. 738+90 - 741+50, crossing, Contractor shall stake R/W, \r\nproposed grades and notify utility 30 days prior to required start gas line work. Utility will directional bore new \r\n6\" plastic gas line. Thirty (30) calendar days required.\r\nALLIANCE PETROLEUM\r\nContact: Ed Mumford, telephone: 724-422-1898, email: emumford@dgoc.com\r\nConstruction Contact: Same\r\nCOORDINATED: (UNDERGROUND) SR 3037, Sta. 17+67, crossing, Utility will abandon existing 2\" steel \r\ngas line. The existing gas line will be purged to remove any residual gas and abandoned in place. Two (2) \r\ncalendar days required.\r\nCOORDINATED: (UNDERGROUND) SR 3037, Sta. 17+95, crossing, Contractor will verify with Utility that \r\nthe location and depth of the relocated gas line will not be in conflict with proposed work. Utility will install a \r\n2\" plastic gas line 10 feet below existing grade, inside a 4\" steel casing. Utility will open cut SR 3037. Two (2) \r\ncalendar days required.\r\nMAWC – WAT E R\r\nContact: Don Guerra, telephone: 724-755-5951, email: daguerra@mawc.org\r\nConstruction Contact: Curt Fontaine, telephone: 724-755-5950, email: fontaine@mawc.org\r\n----------------Page (13) Break----------------\r\nECMS Highway Construction Contract 31895\r\nJanuary 9, 2020 08:37:55 AMPage 65 of 319\r\nPRIOR: (UNDERGROUND) SR 3037, Sta. 17+50 to 28+00 RT, Utility will install water line in north bound \r\ntravel lane, crossing at Sta. 28+50 and continue LT from Sta. 28+50 to Sta. 37+00 at the edge of the R/W \r\nthen crossing to the right side and connecting to existing waterline.\r\nPRIOR: (UNDERGROUND) SR 3014, Sta. 80+00 to Sta. 100+00 LT, Utility will install waterline at edge of \r\nand within legal right of way.\r\nPRIOR: (UNDERGROUND) T-529, Sta. 42+50 LT to Sta. 43+50 LT, Utility will install waterline.\r\nNOT AFFECTED: (UNDERGROUND) S.R. 3010, Sta. 108+00 to Sta. 112+00. Existing 12\" water line to \r\nremain.\r\nAnticipated completion is March 30, 2020\r\nMAWC – SANITARY SEWER\r\nContact: Norman Stout, Jr., telephone: 724-640-7403, email:NStout@mawc.org\r\nConstruction Contact: Same\r\nNOT AFFECTED: (UNDERGROUND) S.R. 3037, crossing Station 40+25 LT and running along S.R. 3014, \r\nStation 80+40 to Station 100+00. Existing 4\" sanitary sewers (2) to remain.\r\nSECTION L-20\r\nWEST PENN POWER\r\nContact: Brad Herrington, telephone 724-626-6227, email: bherrin@firstenergycorp.com Construction \r\nContact: Same\r\nPRIOR: (AERIAL) SR 0070, Sta. 778+80, 62’ LT, Pole to be removed\r\nPRIOR: (AERIAL) SR 0070, Sta. 790+25, 75’ RT, Reset anchor/guy\r\nPRIOR: (AERIAL) SR 0070, Sta. 792+20, 61’ LT, Relocate pole #71515 to Sta. 792+18, 98’ LT\r\nPRIOR: (AERIAL) SR 0070, Sta. 792+30, 69’ RT, Relocate pole #715016 to Sta. 792+32, 93’ RT\r\nAnticipated completion is December 31, 2019\r\nNOT AFFECTED: Poles at the following locations are within the project limits and will remain in place:\r\nSR 0070, Sta. 812+42, 74’ LT, No Pole Number\r\nSR 0070, Sta. 813+25, 85’ LT, WPP pole #297451\r\nDQE COMMUNICATIONS\r\nContact: Adam Nulph, telephone: 724-919-7258, email: ACNulph@dqe.com\r\nConstruction Contact: Same\r\nPRIOR: (AERIAL) SR 0070, Sta. 792+24 crossing, Utility will relocate fiber optic to poles set by West Penn \r\nPower.\r\n----------------Page (14) Break----------------\r\nECMS Highway Construction Contract 31895\r\nJanuary 9, 2020 08:37:55 AMPage 66 of 319\r\nUtility start work after notification from West Penn Power that their work is complete.\r\nAnticipated completion for all is January 10, 2020\r\nCOMCAST\r\nContact: Brian Woller, telephone: 724-691-0614, email: brian_woller@cable.comcast.com\r\nConstruction Contact: Same\r\nPRIOR: (AERIAL) SR 0070, Sta. 792+20, 61’ LT and Sta. 792+30, 69’ RT, Utility will attach to West Penn \r\nPower poles at Sta. 792+18, 98’ LT and Sta. 792+32, 93’ RT and install down guys\r\nUtility will start work after notification by DQE Communications that their work is complete.\r\nAnticipated completion is January 24, 2020\r\nVERIZON\r\nContact: Jeff Guido, telephone: 412-855-1376, email: jeffrey.d.guido@verizon.com\r\nConstruction Contact: Same\r\nCOORDINATED: (AERIAL) SR 0070, Utility will relocate poles at Sta. 794+20, 80’ RT, pole #454/11, Sta. \r\n797+10, 92’ RT, pole #454/10 and Sta. 799+50, 87’ RT, pole #454/9 to the right side of T-612 Marginal Rd. \r\nFifteen (15) calendar days required.\r\nCOORDINATED: (AERIAL) SR 0070, Sta. 794+20 to 799+50 RT, Utility will place and splice new cables \r\nalong the right side of T-612 Marginal Rd. Five (5) calendar days required.\r\nCOORDINATED: (AERIAL) SR 0070, Sta. 794+20 to 799+50 RT, Utility will remove cables and poles along \r\nthe right side of SR 0070. Five (5) calendar days required.\r\nContractor will give 30 day notification to Utility to begin work.\r\nNOT AFFECTED: Poles at the following locations are within the project limits and will remain in place:\r\nSR 0070, Sta. 802+12, 106’ RT, pole #454/8\r\nSR 0070, Sta. 804+38, 103’ RT, pole #454/7\r\nSK OPERATING\r\nContact: Sam Kimmel, telephone: 724-352-0600, email: sam@skoperating.com\r\nConstruction Contact: Same\r\nCOORDINATED: (UNDERGROUND) SR 0070, Sta. 811+25, crossing, Utility has a 2\" gas line crossing. \r\nUtility will cut, cap and purge gas line outside R/W left and right. Fourteen (14) calendar days required\r\nContractor will give 30 day notification to SK Operating to begin work.\r\n \r\nG4802A - a04802 INDEX PRICE FOR DIESEL FUEL\r\nAddendum:\r\n----------------Page (15) Break----------------\r\nECMS Highway Construction Contract 31895\r\nJanuary 9, 2020 08:37:55 AMPage 67 of 319\r\nAssociated Item(s):\r\n \r\nHeader:\r\nIndex Price for Diesel Fuel\r\n \r\nProvision Body:\r\nThe index price for diesel fuel (FB), as determined by the Department, is $1.87 per gallon. Use this index price in accordance with \r\nSection 110.12 PRICE ADJUSTMENT FOR DIESEL FUEL COST FLUCTUATIONS.\r\n \r\nG4901A - a04901 PRICE INDEX FOR ASPHALT CEMENT\r\nAddendum:\r\nAssociated Item(s):\r\n \r\nHeader:\r\nPRICE INDEX FOR ASPHALT CEMENT\r\n \r\nProvision Body:\r\nThe price index for asphalt cement (PG 64-22), as determined by the Department is $483.00 per ton. Use this price index in \r\naccordance with Section 110.04 PRICE ADJUSTMENT OF BITUMINOUS MATERIALS.\r\n \r\nN10560B - a10560 ENVIRONMENTAL COMMITMENTS AND MITIGATION TRACKING SYSTEM (ECMTS) \r\nREVIEW AND SIGN-OFF\r\nAddendum:\r\nAssociated Item(s):\r\n \r\nHeader:\r\nENVIRONMENTAL COMMITMENTS AND MITIGATION TRACKING SYSTEM (ECMTS) REVIEW AND SIGN-OFF\r\n \r\nProvision Body:\r\nRefer to the Environmental Commitments and Mitigation Tracking System (ECMTS) Report for information related to the mitigation \r\ncommitments and tracking documents for the project. Refer to the attached ECMTS construction tracking signature sheet (ECMTS \r\nSignature Sheet) for a list of the commitments to be tracked.\r\nNote: The ECMTS is not an all-inclusive list of permit requirements. Read the permit and comply with all permit requirements.\r\nDesignate a responsible individual (Project Manager or Site Superintendent) to maintain the ECMTS Signature Sheet during \r\nconstruction. Identify the designated individual's name in a note at the bottom of the ECMTS Signature Sheet. Include additional \r\nnames if responsible individuals change during the construction of the project.\r\nReview each Mitigation Category and associated mitigation or commitment identified in the ECMTS Signature Sheet at the Pre-\r\nconstruction Conference. As each mitigation or commitment is completed, initial and date the appropriate block. By initialing and \r\ndating the block, the designated individual confirms the mitigation or commitment has been reviewed, understood, and has been \r\nincorporated in the construction of the project, as appropriate.\r\n----------------Page (16) Break----------------\r\nECMS Highway Construction Contract 31895\r\nJanuary 9, 2020 08:37:55 AMPage 68 of 319\r\nEnsure that the mitigation commitments are completed as early as possible depending on the sequencing and construction \r\nschedule. Review the ECMTS Signature Sheet at each status meeting. The Department Construction Project Manager will verify, \r\ndate, and initial each mitigation commitment as it is completed.\r\nDirect questions regarding the mitigation commitments to the assigned District Environmental Unit staff. Notify the assigned District \r\nEnvironmental Unit staff of any problems with implementing the commitments. Changes to mitigation or commitments will be \r\nreviewed and approved by the assigned District Environmental Unit staff in coordination with the relevant resource agencies and \r\nFHWA, as appropriate. Notify the District Construction ACE Services Engineer of any problems encountered during the \r\nimplementation of the commitments and mitigation measures.\r\nMaintain one copy of the ECMTS Signature Sheet at the Contractor's project field office and provide one copy to the Inspector-In-\r\nCharge after each update.\r\nSubmit one copy of the completed ECMTS Report to the Department IIC Construction Project Manager, one copy to the District \r\nACE Construction Services Engineer, and one copy to the assigned District Environmental Unit staff upon completion of the \r\nproject.\r\nThis work includes the review and sign off of the ECMTS Signature Sheet only and is considered incidental.\r\n \r\n00 - a10561 ARCHAEOLOGICAL SITE PROTECTION\r\nAddendum:\r\nAssociated Item(s):\r\n \r\nHeader:\r\nARCHAEOLOGICAL SITE PROTECTION\r\n \r\nProvision Body:\r\nFor SR 8030 Ramp A, Station 112+00 to 114+00, LT: Use geotextile and fill for any temporary access to S-38175. The process of \r\ninstalling and subsequently removing geotextile and fill must be done in a manner that will ensure that the soil package is \r\nprotected from compaction and other disturbance as specified below.\r\n•If removal of vegetation (including trees) is required, only hand held tools are permitted. Vegetation must be cut flush \r\nwith the ground surface. No grubbing is to be performed, leaving all roots in place.\r\n•Excavation, grading, or removal of topsoil is not permitted.\r\n•A layer of class 4, Type C geotextile will be placed by hand over the area to be protected.\r\n•At least a one foot layer of coarse sand or aggregate will be placed over the geotextile in a manner that does not \r\nsubject the area to be protected to compression. The equipment placing the fill material will run on the surface of the \r\nplaced material and not on the original ground surface. To avoid damage to the original ground surface, the sand or \r\naggregate material will not be compacted with vibration equipment. The pressure placed on the existing ground surface \r\nmust not exceed 7.88 pounds per square inch (psi).\r\n•At least two feet of fill material should be placed over the sand or aggregate. The minimum depth of fill will depend on \r\nthe size and weight of equipment to be used in the temporary construction area. To avoid damage to the original ground \r\nsurface, the fill material will not be compacted with vibration equipment. The pressure placed on the existing ground \r\nsurface must not exceed 7.88 pounds per square inch (psi).\r\n•At the completion of the project, the fill material will be removed in a manner similar to which it was placed and will \r\nensure that the area is not subject to compression or other disturbance during removal. The equipment removing the fill \r\nmaterial will not run on the original ground surface during the removal process.\r\n•The geotextile material will be removed by hand.\r\n•The area should be reseeded using an approved PennDOT seed mixture, according to the provisions of the contract.\r\nAt least a one foot layer of coarse sand or aggregate will be placed over the geotextile in a manner that does not subject the area \r\nto be protected to compression. The equipment placing the fill material will run on the surface of the placed material and not on the \r\noriginal ground surface. To avoid damage to the original ground surface, the sand or aggregate material will not be compacted with \r\nvibration equipment. The pressure placed on the existing ground surface must not exceed 7.88 pounds per square inch (psi).\r\n----------------Page (17) Break----------------\r\nECMS Highway Construction Contract 31895\r\nJanuary 9, 2020 08:37:55 AMPage 69 of 319\r\nAt least two feet of fill material should be placed over the sand or aggregate. The minimum depth of fill will depend on the size and \r\nweight of equipment to be used in the temporary construction area. To avoid damage to the original ground surface, the fill material \r\nwill not be compacted with vibration equipment. The pressure placed on the existing ground surface must not exceed 7.88 pounds \r\nper square inch (psi).\r\n \r\nD10561A - a10561 ENVIRONMENTAL COMMITMENTS and MITIGATION TRACKING SYSTEM (ECMTS) \r\nREPORT\r\nAddendum:\r\nAssociated Item(s):\r\n \r\nHeader:\r\nENVIRONMENTAL COMMITMENTS and MITIGATION TRACKING SYSTEM (ECMTS) REPORT\r\n \r\nProvision Body:\r\nI. DESCRIPTION - This work is the review and reevaluation of the environmental documents and the updating, documentation, \r\nand implementation of the environmental commitments identified in the project Environmental Commitments and Mitigation \r\nTracking System (ECMTS) Report.\r\na) Compliance with Environmental Documents\r\nDevelop Final Design and complete construction activities in compliance with the mitigation and commitments detailed in the \r\napproved Environmental Documents and permits (attached to ECMS project development checklist). The Department has \r\nobtained environmental clearance for this project in the form of a Categorical Exclusion Evaluation (CEE). The complete \r\nenvironmental document can be obtained online through the CEE Expert System’s Approved Document Archive at the following \r\nweb address: http://www.dotdom2.state.pa.us/ceea/ceeamain.nsf by entering Package Number 31895 into the search tool and \r\nselect the returned document link.\r\nReevaluate the Environmental Document if the design does not conform to the environmental impacts described in the approved \r\nEnvironmental Document, or if any anticipated impacts to natural or cultural resources are different from the anticipated impacts \r\nevaluated in the approved Environmental Document. Reevaluation must be approved before the start of construction activities. \r\nCoordinate as needed with the assigned District Environmental Unit staff to obtain approval of the reevaluations. No extension of \r\nthe project completion date will be granted.\r\nb) Mitigation Tracking\r\nRefer to the Environmental Commitments and Mitigation Tracking System Report for information related to the mitigation \r\ncommitments and tracking documents for the project. Refer to the attached ECMTs Matrix for a list of the commitments to be \r\ntracked.\r\nNote: The ECMTS is not an all-inclusive list of permit requirements. Read the permit and comply all permit requirements.\r\nFollowing the procedures in Appendix T of PennDOT Publications 10X, update the matrix with environmental commitments and \r\nmitigation activities identified after NEPA approval.\r\nCreate a signature sheet to be used during construction based on the template in Appendix T of PennDOT Publication 10X. \r\nDesignate a responsible individual (Project Manager or Site Superintendent) to maintain the ECMTS Signature Sheet during \r\nconstruction. Identify the designated individual's name in a note at the bottom of the ECMTS Signature Sheet. Include additional \r\nnames if responsible individuals change during the construction of the project.\r\nReview each Mitigation Category and associated mitigation or commitment identified in the ECMTS Signature Sheet at the Pre-\r\nconstruction Conference. As each mitigation or commitment is completed, initial and date the appropriate block. By initialing and \r\ndating the block, the designated individual confirms the mitigation or commitment has been reviewed, understood, and has been \r\nincorporated in the construction of the project, as appropriate.\r\n----------------Page (18) Break----------------\r\nECMS Highway Construction Contract 31895\r\nJanuary 9, 2020 08:37:55 AMPage 70 of 319\r\nEnsure that the mitigation commitments are completed as early as possible depending on the sequencing and construction. \r\nReview the ECMTS Signature Sheet at each status meeting. The Department Construction Project Manager will verify, date, and \r\ninitial each mitigation commitment as it is completed.\r\nDirect questions regarding the mitigation and commitments to the assigned District Environmental Unit staff. Notify the assigned \r\nDistrict Environmental Unit staff of any problems with implementing the commitments. Changes to mitigation or commitments will \r\nbe reviewed and approved by the assigned District Environmental Unit staff in coordination with the relevant resource agencies \r\nand FHWA as appropriate. Notify the Construction ACE Services Engineer of any problems encountered during the \r\nimplementation of the commitments and mitigation measures.\r\nMaintain one copy of the ECMTS Signature Sheet at the Contractor's project field office and provide one copy to the Inspector-In-\r\nCharge after each update.\r\nSubmit one copy of the completed ECMTS Signature Sheet to the Department IIC Construction Project Manager, one copy to the \r\nDistrict ACE Construction Services Engineer, and one copy to the assigned District Environmental Unit staff upon completion of the \r\nproject.\r\nII. MEASUREMENT AND PAYMENT – Incidental to the design activities listed in Section IV of the Special Provision titled \r\nSPECIAL BIDDING – DESIGN-BUILD.\r\n \r\nN10650B - a10650 MINIMUM EFFECTIVE ASPHALT FOR 9.5 MM OR 12.5 MM SUPERPAVE MIXTURES\r\nAddendum:\r\nAssociated Item(s):\r\n \r\nHeader:\r\nMINIMUM EFFECTIVE ASPHALT FOR 9.5 MM OR 12.5 MM SUPERPAVE MIXTURES\r\n \r\nProvision Body:\r\nSubmit a 9.5 mm or 12.5 mm Superpave mix design prepared as specified in Section 409.2, in accordance with Bulletin 27, and as \r\nfollows:\r\n•Submit a design with minimum effective asphalt (Pbe) based on the combined aggregate bulk specific gravity (Gsb) in \r\naccordance with the Minimum Pbe Table below.\r\n•New designs need to meet the minimum Pbe requirements in the Table below along with existing volumetric requirements \r\nas listed in Bulletin 27 Chapter 2A.\r\nMinimum Pbe\r\nGsb9.5 mm Superpave Mixes12.5 mm Superpave Mixes\r\n2.250 to 2.2746.25.8\r\n2.275 to 2.3246.15.7\r\n2.325 to 2.3746.05.6\r\n----------------Page (19) Break----------------\r\nECMS Highway Construction Contract 31895\r\nJanuary 9, 2020 08:37:55 AMPage 71 of 319\r\n2.375 to 2.4245.95.5\r\n2.425 to 2.4745.85.4\r\n2.475 to 2.5245.75.3\r\n2.525 to 2.5745.65.2\r\n2.575 to 2.6245.55.1\r\n2.625 to 2.6745.45.0\r\n2.675 to 2.7245.34.9\r\n2.725 to 2.7745.24.8\r\n2.775 to 2.8245.14.7\r\n2.825 to 2.8745.04.6\r\n2.875 to 2.9244.94.5\r\n2.925 to 2.9744.84.4\r\n2.975 to 3.0244.74.3\r\n3.025 to 3.0744.64.2\r\nChanges to Previously Approved Mix Designs*:\r\n•Changes to a previously approved 9.5 mm or 12.5 mm mix design that meet or exceed the requirements in the “Minimum \r\nPbe” Table will not be allowed.\r\n•Additional virgin asphalt binder will be allowed provided the minimum Pbe is met or exceeded and all other mix properties \r\nare met.\r\n•Ndesign air voids may range from 3.5% to 4.0% for mixture design. \r\n•The maximum Design voids filled with asphalt (VFA) is revised to 80.\r\n•Follow the steps below to achieve the minimum Pbe:\r\n----------------Page (20) Break----------------\r\nECMS Highway Construction Contract 31895\r\nJanuary 9, 2020 08:37:55 AMPage 72 of 319\r\n•Step 1\r\n•Verify the additional virgin asphalt binder content according to Bulletin 27, Appendix J, Section \r\nC.  If the laboratory mixed, laboratory compacted specimens meet Bulletin 27, Condition B of \r\nAppendix J, Table J -2, then no other adjustments to proportions or gradation will be required.\r\n•Step 2\r\n•If the addition of virgin asphalt cannot meet Bulletin 27, Condition B of Appendix J, Table J-2, \r\ngradation changes are permissible as long as changes are within multiple sample tolerances as \r\nspecified in Section 409.2(e) Table A.\r\n•Step 3\r\n•If Bulletin 27, Condition B of Appendix J, Table J-2 cannot be achieved with Step 1 or Step 2, a \r\ncomplete re-design of the JMF will be required.\r\n(* Previously Approved Mix Designs- JMF’s approved in previous year or new designs submitted with the only change being either \r\nPG grade or HMA to WMA, with no changes to target asphalt content or gradation)\r\n \r\nN13101A - a13101 CONSTRUCTION PROJECT TRAFFIC BARRIER PRE-INSTALLATION REVIEW\r\nAddendum:\r\nAssociated Item(s):\r\n \r\nHeader:\r\nCONSTRUCTION PROJECT TRAFFIC BARRIER PRE-INSTALLATION REVIEW\r\n \r\nProvision Body:\r\nNotify the Inspector-in-Charge of the proposed schedule for Traffic Barrier installation, a minimum of two weeks before beginning \r\ninstallation. The Inspector-in-Charge will contact the FHWA Transportation Engineer and the District Guide Rail Mentor to schedule \r\nthe pre-installation review. Contractor attendance at the pre-installation review is required.\r\nBefore the review, place temporary markings (paint, stakes, or flags) indicating planned locations of all permanent traffic barrier to \r\nbe installed as part of the project. The term Traffic Barrier includes all types of permanent barrier including, but not limited to, W-\r\nbeam guide rail, concrete median barrier, cable barrier, end treatments, and impact attenuating devices.\r\nDo not install any Traffic Barrier on the project before receiving written authorization from the Inspector-in-Charge.\r\nCosts associated with placement of the temporary markings, and attendance at the Pre-Installation Review are considered \r\nincidental to other items of work, and no separate payment will be made. Revisions to contract quantities of Traffic Barrier will be \r\npaid in accordance with Section 110.\r\n \r\nN13401B - a13401 SAFETY EDGE SM\r\nAddendum:\r\nAssociated Item(s):\r\n \r\nHeader:\r\nSAFETY EDGE SM\r\n \r\n----------------Page (21) Break----------------\r\nECMS Highway Construction Contract 31895\r\nJanuary 9, 2020 08:37:55 AMPage 73 of 319\r\nProvision Body:\r\nCONSTRUCTION - As shown on the Standard Drawings and as follows:\r\nAttach a device to the paver to confine material at the end gate and extrude the asphalt material in a wedge shape. Use an \r\nadjustable device that allows the operator to vary the slope extruded at the paver to account for the angle becoming steeper during \r\ncompaction (roll up). Before construction, the Safety EdgeSM device must be approved by the Representative.\r\nCompact the roadway or paved shoulder as required by the specifications for these material applications. Do not delay rolling of \r\nthe mat adjacent to the Safety EdgeSM. After compaction of the mat is complete, provide a Safety Edge SM meeting the final shape \r\nrequirements of the Safety EdgeSMDetails. The completed angle of the Safety EdgeSMmust be 26 - 40 degrees measured from the \r\npavement cross slope extended. At the beginning of each days paving, measure the angle of the Safety EdgeSMfrom the \r\npavement cross slope extended. Perform measurement after final compaction is complete. If the angle of the Safety EdgeSMdoes \r\nnot meet the slope requirements, stop paving and provide corrective action. Do not resume production paving until the final shape \r\nrequirements of Safety EdgeSMare achieved.\r\nAllow automatic transition to intersections, driveways, guide rail sections, and obstructions.\r\nUse the device to constrain the asphalt head, reducing the area and increasing the density of the extruded profile. A single plate \r\nstrike-off method is not allowed.\r\n \r\nD29890C - a29890 SPECIAL BIDDING – DESIGN-BUILD\r\nAddendum:\r\nAssociated Item(s):\r\n \r\nHeader:\r\nSPECIAL BIDDING – DESIGN-BUILD\r\n \r\nProvision Body:\r\nThis project will utilize the Low Bid Design-Build method of contracting. The contract for this project will be between the \r\nDepartment and the successful Bidder.\r\nI. ACTIONS REQUIRED BY THE BIDDER AT THE BIDDING STAGE AND BEFORE AWARD\r\nWhen signing and submitting the bid, the Bidder is required to certify the following for all professional service firms (firms) \r\nperforming activities listed in Section IV – Design Activities:\r\n•that, if applicable, the Bidder either (a) has obtained assurance that all firms being used have no adverse interests as \r\ndefined in the State Adverse Interest Act and fully comply with this Special Provision or (b) has faxed a letter to the Contract \r\nAwards Officer at (717) 705-1504 disclosing any potential conflicts;\r\n•that, if applicable, the Bidder (a) has obtained assurance that all firms being used have no organizational conflicts of \r\ninterests and fully comply with this Special Provision or (b) has faxed a letter to the Contract Awards Officer at (717) \r\n705-1504 disclosing any potential conflicts;\r\n•that, if applicable, the Bidder (a) has obtained assurance that all firms being used have fully complied with Section III of this \r\nSpecial Provision or (b) will email or fax a completed \"Request for Consideration of Professional Services Involvement \r\nRestrictions\" form to the District Project Manager indicated in the Section V - Review Submission Contacts of this Special \r\nProvision; and\r\n•that, if applicable, the Bidder has obtained assurance that all firms being used are familiar with the necessary AASHTO, \r\nPennDOT, and other applicable design criteria, standards, and construction specifications required to complete the related \r\nportion of their associated work.\r\nState Adverse Interest Act – Where required, fully disclose any potential conflict with the State Adverse Interest Act as State \r\nAdvisor or State Consultant. If there is no adverse interest, certify as such.\r\n----------------Page (22) Break----------------\r\nECMS Highway Construction Contract 31895\r\nJanuary 9, 2020 08:37:55 AMPage 74 of 319\r\nOrganizational Conflict of Interest – Where required, fully disclose all relevant facts concerning any past, present, or currently \r\nplanned interests that may present an Organizational Conflict of Interest. This disclosure must state how their interests or those of \r\ntheir chief executives, directors, key project personnel, or any proposed firm could be viewed as, an Organizational Conflict of \r\nInterest. If there is no Organizational Conflict of Interest, certify as such. Note: An Organizational Conflict of Interest is defined in \r\n23 CFR 636 as a conflict “that because of other activities or relationships with other persons, a person is unable or potentially \r\nunable to render impartial assistance or advice to the owner, or the person’s objectivity in performing the contract work is or might \r\nbe otherwise impaired, or a person has an unfair competitive advantage.”\r\nProfessional Services Involvement Restrictions – Where required, indicate that involvement in such firms can be avoided, \r\nneutralized, or mitigated by completing the following:\r\n•present these involvements on the \"Request for Consideration for Professional Services Involvement Restrictions\" form, \r\nlocated in ECMS File Cabinet (in the References Tab); and\r\n•email or fax this form immediately upon ECMS email notification of apparent low bidder status to the District Project \r\nManager indicated in Section V – Review Submission Contacts of this Special Provision.\r\nThe District Project Manager will notify the apparent low bidder of the result.\r\nII. ACTION TO BE TAKEN BY THE BIDDER AFTER AWARD\r\nDesign Activity Firm Identification and Qualifications\r\nThe awarded bidder is required to complete the form, “Design-Build Design Activities Firm Identification and Qualifications”. This \r\nform is located in ECMS File Cabinet (in the References Tab).\r\nEmail or fax the completed form to the District Project Manager indicated in the Section V - Review Submission Contacts of this \r\nSpecial Provision within 3 calendar days after the award of the contract.\r\nInclude on this form the name and design activity performed by each firm performing activities listed in Section IV Design Activities \r\nof this Special Provision. Include with this form resumes for the:\r\n•Lead Design Engineer Project Manager;\r\n•Quality Control (QC) Manager and Alternate QC Manager;\r\n•Quality Assurance (QA) Manager (if applicable) and Alternate QA Manager; and\r\n•Secondary Design Services Professionals (if applicable) Project Manager.\r\nThese resumes should show the experience and expertise required by the project special provisions for the applicable design \r\nactivities listed in Section IV – Design Activities of this Special Provision. At a minimum, these resumes should show experience \r\nand expertise during the last 7 years, of two similar projects of comparable complexity on Pennsylvania's State Highway, \r\nPennsylvania Turnpike, or local system. Non-Turnpike projects must have been funded with Federal Aid Highway Funds. Also, \r\ninclude an affidavit stating that the Lead Design Engineer is familiar with AASHTO, the Department, and other applicable design \r\ncriteria, standards, and construction specifications. Additional design qualifications may be listed in other Design-Build Special \r\nProvisions included in this Contract.\r\nAll engineering firms must have a current Annual Qualification Package on file with the Bureau of Project Delivery's Contract \r\nManagement Section and be registered business partners in ECMS. In addition, engineering firms’ business partner relationship in \r\nECMS must include both Consultant and Construction Contractor relationships. The ECMS USER ID security must include \r\nConstruction Contractor security groups such as \"Contractor Principal.\" Firms must be listed as a Prequalification Exempt Service \r\nProvider in the subcontractor database with the Department’s Prequalification Office. These requirements also apply to all \r\nsubconsultants, including Disadvantaged Business Enterprises, Minority Business Enterprises, and Women-Owned Business \r\nEnterprises.\r\nFor projects that include Right-of-Way Acquisition services, the right-of-way firm must be pre-approved to provide Right-of-Way \r\nAcquisition Services through ECMS.\r\nAll firms must comply with the restrictions listed in 23 CFR 636.116 titled What organizational conflict of interest requirements apply \r\nto design-build projects?\r\nIf a firm included in the submission does not meet the necessary requirements indicated in this Special Provision and in the project \r\nspecial provisions for the applicable design activities listed in Section IV – Design Activities of this Special Provision, the \r\n----------------Page (23) Break----------------\r\nECMS Highway Construction Contract 31895\r\nJanuary 9, 2020 08:37:55 AMPage 75 of 319\r\nDepartment reserves the right to disallow the firm for this contract. Firms identified on a \"Request for Consideration for \r\nProfessional Services Involvement Restrictions\" form that has been submitted but not approved will be disallowed. A notification \r\nwill be given to the Contractor within 8 calendar days from the time and date of submission indicating the Department approval or \r\ndisallowance, and justification thereof, of each firm listed on the “Design-Build Design Activities Firm Identification and \r\nQualifications” form. A firm cannot begin work on this contract until approval is received from the Department. Unless indicated \r\notherwise by the Department in writing, the disapproval of any firm will not allow the extension of the contract completion date or \r\nprice adjustments to any items in the contract.\r\nIII. PROFESSIONAL SERVICES INVOLVEMENT RESTRICTIONS\r\nAll firms performing activities listed in Section IV – Design Activities of this Special Provision must be in compliance with the \r\nfollowing paragraphs and the Professional Services Involvement Restrictions – Design Activities of this Special Provision for \r\nDesign-Build Contracts charts [Table A and Table B].\r\n•Any Consultant that provided or is providing any design work and services to the Department for the preparation of this \r\ndesign-build bid package will not be eligible to provide any design work and services to the Contractor for the design-build \r\ncontract.\r\n•Any Consultant performing design work or services to the Contractor for this design-build contract, such as Lead Design \r\nEngineer, Quality Control Reviewer, Secondary Design Service Professionals, or Quality Assurance Reviewer (if \r\napplicable), is not eligible for any involvement under a Department Agreement on that contract.\r\nDEFINITIONS:\r\nPRIME CONSULTANT (Department agreement) – The contractual party providing design consultant work and services pursuant to \r\nan Agreement with the Department. The Consultant may be an individual, partnership, corporation, or joint venture.\r\nSUB-CONSULTANT (Department agreement) - The party providing design work and services to the Prime Consultant (which is \r\nproviding consultant work and services pursuant to an agreement with the Commonwealth) pursuant to an agreement with the \r\nPrime Consultant to which the Department is not a party.\r\nLEAD DESIGN ENGINEER (LDE) (design-build contract) – The design consultant engineering firm or Contractor’s personnel that \r\nare responsible for the design portion of the design-build contract.\r\nQUALITY CONTROL REVIEWER (QC-R) (design-build contract) - The design consultant engineering firm or individuals that are \r\nresponsible to manage the quality control of the design-build contract, including the Quality Control Manager and the Alternate \r\nQuality Control Manager. The design Quality Control Reviewer is allowed to be the same firm as the Lead Design Engineer.\r\nQUALITY ASSURANCE REVIEWER (QA-R) (Department agreement or design-build contract, if applicable)– The design \r\nconsultant engineering firm or individuals functioning as Department and FHWA (as appropriate) representatives who check the \r\nvalidity of the Contractor’s Quality Plan to ensure all work is done in accordance with the contract documents. Quality Assurance \r\nReviewer may be Department and/or FHWA personnel, consultants under a Department agreement, or a firm providing design \r\nservices to the design-build Contractor (if included as a design activity in Section IV Design Activities of this Special Provision, as \r\n“Quality Assurance by Peer Review). The Quality Assurance Reviewer may not be the same firm as the Contractor, the Lead \r\nDesign Engineer, or the Quality Control Reviewer.\r\nSECONDARY DESIGN SERVICE PROFESSIONALS (SDSP) (design-build contract)– Other design consultant engineering firms \r\nor professional service firms providing professional services to the design-build Contractor beyond roles of Lead Design Engineer \r\nor design Quality Control Reviewer.\r\nPROFESSIONAL SERVICES INVOLVEMENT RESTRICTIONS - DESIGN ACTIVITIES FOR DESIGN-BUILD CONTRACTS:\r\nTABLE A: INVOLVEMENT AS PRIME OR SUB CONSULTANT TO THE DEPARTMENT\r\nPROJECT INVOLVEMENT\r\n(Prime Consultant/Sub-consultant in Department \r\nAgreement)\r\nDESIGN ACTIVITY RESTRICTIONS\r\n----------------Page (24) Break----------------\r\nECMS Highway Construction Contract 31895\r\nJanuary 9, 2020 08:37:55 AMPage 76 of 319\r\nFeasibility Studies, Traffic Studies, Mapping ServicesNo restrictions if no recommendations to the Department made by the Consultant\r\nPreliminary Engineering, Preliminary Engineering \r\nConstructability Reviews, and Environmental Studies \r\nAnticipating a CEE\r\nNot eligible to perform any design work or services to the \r\nContractor for the design-build contract.\r\nException (1) – See “Sub-consultant Exception” below.\r\nPreliminary Engineering, Preliminary Engineering \r\nConstructability Reviews, and Environmental Studies \r\nAnticipating an EA/ EIS\r\nNot eligible to perform any design work or services to the \r\nContractor for the design-build contract.\r\nException (1) – See “Sub-consultant Exception” below.\r\nConceptual Design / Bid Package Preparation for Design-Build \r\nProject\r\nNot eligible to perform any design work or services to the \r\nContractor for the design-build contract.\r\nException (1) – See “Sub-consultant Exception” below.\r\nFinal DesignNot eligible to perform any design work or services to the Contractor for the design-build contract.\r\nPreliminary Engineering-Design Management, Review\r\nNote: This includes consultants performing reviews for a District \r\nor Central Office Agreement, including an Open End Agreement.\r\nNot eligible to perform any design work or services to the \r\nContractor for the design-build contract.\r\nException (1) – See “Sub-consultant Exception” below.\r\nFinal Design Management, Review\r\nNote: This includes consultants performing reviews for a District \r\nor Central Office Agreement, including an open-end agreement.\r\nNot eligible to perform any design work or services to the \r\nContractor for the design-build contract.\r\nDepartment Review (Any design review completed as a \r\nrepresentative of the Department, including Quality Assurance \r\nReviews)\r\nNot eligible to perform any design work or services to the \r\nContractor for the design-build contract.\r\nConstruction Management Support (Any construction activity \r\ncompleted as a representative of the Department other than \r\nconstruction inspection, or services during construction)\r\nNot eligible to perform any design work or services to the \r\nContractor for the design-build contract\r\nServices during Construction\r\n(Any design support services/reviews conducted during \r\nconstruction)\r\nNot eligible to perform any design work or services to the \r\nContractor for the design-build contract.\r\nConstruction InspectionNot eligible to perform any design work or services to the Contractor for the design-build contract.\r\n(1) Sub-consultant Exception – A Sub-consultant performing certain activities under a Department agreement containing multiple \r\n“projects,” which are let under separate construction contracts, can perform design activities as part of the design-build contract \r\n----------------Page (25) Break----------------\r\nECMS Highway Construction Contract 31895\r\nJanuary 9, 2020 08:37:55 AMPage 77 of 319\r\nprovided that the design activities for the design-build contract is for a “project” in which the sub-consultant did not participate in \r\nANY work for the Department.\r\nSee Table A.1: Department Agreement Containing Multiple Projects – Sub-consultant Eligibility.\r\nTABLE A.1: DEPARTMENT AGREEMENT CONTAINING MULTIPLE PROJECTS – SUB-CONSULTANT ELIGIBILITY\r\nSub-consultant Performed \r\nWork Only on Project A \r\n(under Department \r\nAgreement)\r\nDesign Activities for Design-Build Contract (under Design-Build Contract)\r\nProject AProject B\r\nLDE, QC-R, or SDSPQA-R1LDE, QC-R, or SDSPQA-R1\r\nPreliminary Engineering \r\nActivities (Does not include \r\nBid Package Prep)\r\nNNY*Y*\r\nConceptual Design/Bid \r\nPackage PreparationNNY*Y*\r\nDepartment Review \r\n(includes Quality Assurance \r\nReview)\r\nNNNN\r\nConstruction Management \r\nor Construction InspectionNNNN\r\nNote: Project A and Project B represent multiple projects under one engineering agreement that are bid under separate \r\nconstruction contracts.\r\nN - Sub-consultant is not eligible to perform service.\r\nY*- A sub-consultant firm, that worked on the preliminary design or the Conceptual Design/Bid Package Prep for Project A, can \r\nfunction as EITHER a Quality Assurance Reviewer (if applicable) OR function as a Lead Design Engineer, Quality Control \r\nReviewer, or Secondary Design Service Provider on Project B.\r\n1 If applicable\r\nTABLE B: INVOLVEMENT INCLUDES PERFORMING DESIGN ACTIVITIES FOR DESIGN-BUILD CONTRACT\r\nPROJECT INVOLVEMENT (Performance of Design Activities \r\nin Design-Build Contract)RESTRICTIONS\r\nLDE\r\nNot eligible for any future involvement under a Department \r\nAgreement for project(s) included in design-build contract, \r\nincluding Department Review, Quality Assurance Review, \r\nConstruction Management, and Construction Inspection \r\nservices.\r\nNot eligible to perform Quality Assurance Reviews (if applicable).\r\n----------------Page (26) Break----------------\r\nECMS Highway Construction Contract 31895\r\nJanuary 9, 2020 08:37:55 AMPage 78 of 319\r\nQC-R\r\nNot eligible for any future involvement under a Department \r\nAgreement for project(s) included in design-build contract, \r\nincluding Department Review, Quality Assurance Review, \r\nConstruction Management, and Construction Inspection \r\nservices.\r\nNot eligible to perform Quality Assurance Reviews (if applicable)\r\nSDSP\r\nNot eligible for any future involvement under a Department \r\nAgreement for project(s) included in design-build contract, \r\nincluding Department Review, Quality Assurance Review, \r\nConstruction Management, and Construction Inspection \r\nservices.\r\nNot eligible to perform Quality Assurance Reviews (if applicable).\r\nQA-R (if applicable)\r\nNot eligible to function as Lead Design Engineer, Quality Control \r\nReviewer, or Secondary Design Services Professionals.\r\nNot eligible for any future involvement under a Department \r\nAgreement for project(s) included in design-build contract, \r\nincluding Department Review, Construction Management, and \r\nConstruction Inspection services.\r\nIV. DESIGN ACTIVITIES\r\nDesign activities include:\r\n•Quality Assurance Review,\r\n•Maintenance and Protection of Traffic Design,\r\nV. REVIEW SUBMISSION CONTACTS\r\nInclude all design activities, submission dates, and review periods in the construction schedule. Include the submission schedule in \r\nthe Quality Plan.\r\n(Select one of two methods: (a) make all submissions to the District Project Manager, or (b) make submissions to one of \r\nthe five contacts and copy the District Project Manager. Delete the method not used. If (a) is selected, delete all text from \r\n(b) up to Section VI. If (b) is used, delete all of (a) up to (b).)\r\n(a) Make all required submissions for each design activity to the Department’s Project Manager.\r\n•Department Project Manager\r\nJeremy Shaneyfelt\r\nPhone number: 724-439-7321\r\nFax number: 724-430-4401\r\nEmail address: jershaneyf@pa.gov\r\nInterim (partial) submissions: PennDOT Project Collaboration Center\r\nAddress for final submissions: District Office – see location information below\r\n----------------Page (27) Break----------------\r\nECMS Highway Construction Contract 31895\r\nJanuary 9, 2020 08:37:55 AMPage 79 of 319\r\nMaintenance and Protection of Traffic Design: (delete if not needed)\r\n•Traffic Control Plan (Preliminary and Final Plans)\r\nContact: Jeremy Shaneyfelt\r\nPhone number: 724-439-7321\r\nFax number: 724-430-4401\r\nEmail address: jershaneyf@pa.gov\r\nInterim (partial) submissions: PennDOT Project Collaboration Center\r\nAddress for final submissions: District Office – location information listed in Section VI of this Special \r\nProvision\r\nVI. LOCATION INFORMATION:\r\nPennsylvania Department of Transportation\r\nDistrict 12 Office\r\nStreet Address: 825 North Gallatin Avenue\r\nUniontown, Pa 15401\r\nThe PennDOT Project Collaboration Center (PPCC) will be used for the purposes of distributing electronic plan submissions to and \r\nfrom reviewing parties as identified in Section V - Review Submission Contacts of this Special Provision. Details will be provided \r\nprior to the Preconstruction Conference.\r\nVII. SUBMISSION REQUIREMENTS/REVIEW TIMES:\r\nThe following table provides the required number of plans and/or documents and the schedule of review times for complete \r\nsubmissions. Partial submissions, where specified, will be reviewed in the time specified below for each submission. Partial \r\nsubmissions will require the submission of the number of plan sets and calculations specified below for the applicable design \r\nactivity. Be responsible for reproduction costs for submissions and final drawings, including providing the Department with (Specify \r\nnumber of full and/or half-size sets) of all final drawings for use during construction, in addition to any copies specified below.\r\n(Instructions: Complete the “Plan Sets” and “Sets of Calculations” columns indicating number of sets required for each \r\nsubmission when not using PPCC. When using PPCC, indicate “PPCC” in each column except for Final submissions, \r\nwhere the number of sets for signature is to be indicated. Delete rows that are not needed. Add rows for other \r\nsubmissions included in design activities but not listed.)\r\n(Note: It is strongly recommended that the review times shown not be modified. Review times will need to be modified to \r\nincorporate additional time for Central Office and FHWA reviews. Items will require an additional 10 working days of \r\nreview time (both initial and subsequent submissions) if Central Office review is required or an additional 20 days of \r\nreview time if Central Office and FHWA review is required.)\r\nItemPlan SetsSets of \r\nCalculations\r\nInitial Submission \r\nReview Time (working \r\ndays)\r\nSubsequent Submission \r\nReview Time (working \r\ndays)\r\nRoadway Design\r\nQuality Plan\r\n----------------Page (28) Break----------------\r\nECMS Highway Construction Contract 31895\r\nJanuary 9, 2020 08:37:55 AMPage 80 of 319\r\nPavement Design\r\nEnvironmental/Permits (PennDOT review)\r\nPermit Review - DEP\r\nPermit Review - ACOE\r\nErosion and Sediment Pollution Control Plan \r\n(County Conservation District Review)\r\nErosion and Sediment Pollution Control Plan \r\n(DEP Review)\r\nNPDES Permit (PennDOT review)\r\nNPDES Review (County Conservation District \r\nReview)\r\nNPDES Review (DEP Review)\r\nDraft Exploration Plan and Schedule of \r\nBorings\r\nGeotechnical Design\r\nPavement Marking Design and Signing\r\nPre-Final Plans\r\nFinal Roadway Plans\r\nAs-Built Roadway Plans\r\nBridge/Structural Design\r\nHydraulics and Hydrologic Report\r\nFinal TS&L\r\nWaterway Permits/Permit Amendments\r\n----------------Page (29) Break----------------\r\nECMS Highway Construction Contract 31895\r\nJanuary 9, 2020 08:37:55 AMPage 81 of 319\r\nFoundation Submission\r\nFinal Structure Plans\r\ngINT Project File\r\nAs-Built Plans\r\nMaintenance and Protection of Traffic Design\r\nTransportation Management Plan3025\r\nIncident Management Plan3025\r\nPreliminary Plan3025\r\nFinal Plan3025\r\nUtility Coordination\r\nUtility Relocation Highway Occupancy Permits\r\nUtility Reimbursement Documentation\r\nROWActivities\r\nPreliminary Right-of-Way Plan\r\nAppraisals\r\nFinal Right-of-Way Plans\r\nModified Final Right-of-Way Plans\r\nCurb Ramp Design\r\nTraffic Signal Permit Plan revisions\r\nTechnical Infeasibility Forms\r\n----------------Page (30) Break----------------\r\nECMS Highway Construction Contract 31895\r\nJanuary 9, 2020 08:37:55 AMPage 82 of 319\r\nCurb Ramp Designs\r\n** - Review times will be in accordance with the regulations of the reviewing agency.\r\nReview times begin and end when a submission is logged in and out, respectively, by all designated reviewers. The login time will \r\nbe taken as the latest date in which the submission is received by the reviewers. Submittals received after 11:00 a.m. will be \r\nlogged in as the next working day following receipt of the submission. For electronic submissions, the login time will be taken when \r\nthe appropriate reviewer and District Project Manager receive an email stating a submission is ready for review. Logout time \r\noccurs when the reviewer sends an email to the Contractor with an approval and/or comments. If a submission is incomplete or \r\notherwise requires additional information or data to complete the review properly, the review time will begin as specified for the \r\nsubmission when all required information is received.\r\nAdditional contract time or price adjustment to any contract items will not be considered due to failure to obtain approvals within \r\nthe specified review times resulting from incomplete or non-conforming submissions. Working days are weekdays, Monday \r\nthrough Friday, excluding official Department holidays.\r\nInclude all review periods identified above as activities in the project schedule.\r\nVIII. GENERAL DESIGN REQUIREMENTS\r\nHave the design completed by a Professional Engineer licensed in the State. Have all surveys completed by a Professional Land \r\nSurveyor licensed in the State.\r\nProvide the Design Engineer's P. E .  seal, the date signed, and business name and address on the first sheet of all computations, \r\nincluding computations for partial submissions. Provide the appropriate seal and signature on plan sheets in accordance with the \r\nDepartment's Design Manuals. Also, provide the Design Engineer's P. E .  seal, signature, and date signed on the first sheet of all \r\ncomputations, including computations for partial plans submissions.\r\nProvide all Professional Engineer’s seals in accordance with Pa. Code § 37.59.\r\nDesigns copied directly from Department Standard Drawings need not be documented through independent computations. List \r\nsuch designs on the submission by referencing the drawing number of the applicable standard, and the sheet number, table, or \r\ngraph.\r\nExperimental or demonstration-type design concepts, products, structures, or elements not pre-approved by the Department for \r\ngeneral usage at the time of bid, will not be allowed.\r\nIf Right-of-Way Design and Acquisition Services has not been identified as Design Activity in Section IV of this Special Provision, \r\nno additional Right-of-Way may be acquired and no changes to the recorded Right-of-Way Plan will be permitted.\r\nValue engineering construction proposals are allowed, provided that the proposal does not require approval of a Design Exception.\r\nDesigns that take advantage of any errors and/or omissions in the following requirements will not be accepted. In the event any \r\nsuch error, omission, or discrepancy is discovered, immediately notify the Department. Failure to notify the Department will \r\nconstitute a waiver of all claims for misunderstanding, ambiguities, or other situations resulting from the error, omission, or \r\ndiscrepancy.\r\nFinal Plans must include a note on all tabulation of quantities sheets included therein that states “Item numbers and descriptions \r\nlisted in Tabulations are solely for the purposes of identifying the specified units of work and locations, and are not to be construed \r\nas contract or pay items.”\r\nDesign and construct any support of excavation required by any Design Activities identified in Section IV of this Special Provision \r\nin accordance with the Special Provision titled TEMPORARY EXCAVATION SUPPORT AND PROTECTION REPORT. (Delete if \r\nnot applicable.)\r\nDesign Specifications\r\n----------------Page (31) Break----------------\r\nECMS Highway Construction Contract 31895\r\nJanuary 9, 2020 08:37:55 AMPage 83 of 319\r\nPerform the design activities identified in Section IV, Design Activities, in accordance with the latest published edition of all \r\nDepartment Standards, Specifications, Regulations, Strike-off Letters, and other industry standards, at the time of advertisement, \r\nunless directed otherwise, or as identified in the bid package. These include, but are not limited to the following:\r\n•Special Provisions;\r\n•Publication 408, Specifications\r\n•Publication 72M, Standards for Roadway Construction\r\n•Publication 218M, Standard Drawings for Bridge Design\r\n•Publication 219M, Standard Drawings for Bridge Construction\r\n•Publication 10 Design Manual Part 1 – Transportation Program Development and Project Delivery Process\r\n•Publication 10A Design Manual Part 1A – Pre-TIP and TIP Program Development Procedures\r\n•Publication 10B Design Manual Part 1B – Post-TIP NEPA Procedures\r\n•Publication 10C Design Manual Part 1C – Transportation Engineering Procedures\r\n•Publication 10X Design Manual Part 1X – Appendices to Design Manuals 1, 1A, 1B, and 1C\r\n•Publication 13M Design Manual Part 2 – Highway Design\r\n•Publication 14M Design Manual Part 3 – Plans Presentation\r\n•Publication 15M Design Manual Part 4 – Structures\r\n•Publication 16M Design Manual Part 5 – Utility Relocation\r\n•Publication 584, Drainage Manual\r\n•Publication 46, Traffic Engineering Manual\r\n•Publication 149, Traffic Signal Design Handbook\r\n•Publication 35, Approved Construction Materials\r\n•Publication 203, Work Zone Traffic Control\r\n•Publication 213, Temporary Traffic Control Guidelines\r\n•Publication 222, Subsurface Boring, Sampling, and Testing Contract\r\n•Publication 293, Geotechnical Engineering Manual\r\n•Publication 378, Right-of-Way Manual\r\n•Pa Code Title 67, Chapter 204, Guidelines to Implement Act 229 of 2002, Additional Traffic Control Devices in Highway \r\nWork Zones, Statement of Policy\r\n•Pa Code Title 67, Chapter 212, Official Traffic Control Devices (Publication 212)\r\n•Publication 236M, Handbook of Approved Signs\r\n•Publication 242, Pavement Policy Manual\r\n•Publication 281, Waste Site Evaluation Procedures for Highway Project Development Process;\r\n•Publication 371, Grade Crossing Manual\r\n•Publication 122M, Surveying and Mapping Manual\r\n•Publication 111, Traffic Control – Pavement Markings and Signing Standards\r\n•Publication 148, Traffic Standards – Signals\r\n•Publication 611, Waste Management Guidance Manual\r\n•Manual on Uniform Traffic Control Devices (FHWA)\r\n•A Policy on Geometric Design of Highway and Streets, AASHTO \"Green Book\"\r\n•A Policy on Design Standards – Interstate System (AASHTO)\r\n•AASHTO Guide Specifications for Horizontally Curved Highway Bridges\r\n•AASHTO LRFD Bridge Design Specifications or, when applicable, AASHTO Standard Specifications for Highway Bridges\r\nIn the event that a clear order of predominance cannot be established, or a difference in interpretation of the design cannot be \r\nresolved, the Assistant District Executive-Design will be the arbiter and his/her decision will be final.\r\nFor bridge/structures related design activities, refer to the \"Bridge/Structures Related Effective Policy Letters\" for additional design \r\npolicy Strike-Off Letters that are applicable to the structure design.\r\nIn the event that certain design parameters, stresses, or specifications are in conflict regarding bridge/structures related design \r\nactivities, the following order of predominance governs:\r\n1.Design requirements listed herein and addenda (addendum) to the proposal.\r\n2.Design related Strike-Off Letters in effect on the date of project advertisement.\r\n3.Publication 15M Design Manual Part 4, Structures\r\n4.Publications 218M and 219M Standard Drawings for Bridge Design and Bridge Construction\r\n5.AASHTO LRFD Bridge Design Specifications or, when applicable, AASHTO Standard Specifications for Highway Bridges\r\n----------------Page (32) Break----------------\r\nECMS Highway Construction Contract 31895\r\nJanuary 9, 2020 08:37:55 AMPage 84 of 319\r\nIn the foregoing instances, in the event that a clear order of precedence cannot be established, or a difference in the interpretation \r\nof the design criteria, standards, specifications, or methodology cannot be resolved, the Chief Bridge Engineer will be the arbiter \r\nand whose decision will be final.\r\nIX. SCHEDULE OF VALUES\r\nWhere indicated, partial payment for lump sum design-build items will be made on Current Estimate Payments in accordance with \r\nSection 110.05 based on the amount of work completed during the estimate period based on a payout schedule (Schedule of \r\nValues). The Department will base amount of the partial payments on the total value of the work performed to the date of the \r\nestimate cut-off, less payments previously made, in accordance with the approved Schedule of Values.\r\nPrepare a Schedule of Values for each lump sum Item associated with the design or construction of the Design Activities identified \r\nin Section IV of this Special Provision, where the Special Provision for that \"Design\" or \"Construct\" Item indicates lump sum \r\nmeasurement and payment by Schedule of Values, using the attached Schedule of Values template as a guide. Hereinafter, \r\nDesign Items are defined as the Contract Item associated with the Design Activities identified in Section IV, and Construct Items \r\nare defined as the Contract Item associated with the construction of the Design Activities identified in Section IV. Distribution of \r\npayments among Schedule of Values Components must bear a reasonable resemblance to the actual value of work.\r\n(a)For Design items, if a Component is not applicable, indicate 0%; otherwise do not indicate values less than 5% in any \r\nComponent. Include those Schedule of Values Components identified in the associated Design Item Special Provisions. Payment \r\nfor Design Item Schedule of Values Components will be made in the amount of the approved percentage upon completion of the \r\nidentified task. When Schedule of Values Components are identified in the Special Provisions with “Approval” in the Schedule of \r\nValues Component title, 75% of the approved percentage may be paid on the next estimate following login of that submission, and \r\nthe remaining 25% of the approved percentage will be paid following approval of that submission. Otherwise, no partial payment \r\nwill be made for Design Item Components.\r\n(b)For Construct Item, include Schedule of Values Components relevant to the scope of work of the particular item, using the \r\nattached Schedule of Values template as a general guide. No partial payment will be made for Construct Item Schedule of Values \r\nComponents. Accordingly, develop the Schedule of Values to include Schedule of Values Components in sufficient numbers and \r\ndetail to be payable upon semi-monthly estimates throughout the duration of the Contract.\r\nSubmit the Schedules of Values to the Department for review and approval. No estimate will be processed until all Schedules of \r\nValues are approved.\r\nX. CONSTRUCTION CONTACT\r\nThe Department’s contact for Current Estimate Payments as defined in Section 110.05 will be:\r\nThe Project Manager identified in Section V of this Special Provision.\r\nXI. FILES AVAILABLE AFTER AWARD (Delete if not applicable.)\r\nMicrostation CADD files will be made available to the successful bidder. After Award, submit a request to the District Executive \r\nagreeing to the terms and conditions for the release of the electronic files.\r\nThe following information will be made available for viewing at the District Office after award:\r\n•Complete permit documents\r\n•Preliminary Geotechnical Engineering Report (delete if not applicable)\r\n•Foundation Report (delete if not applicable)\r\nContact the Project Manager identified in Section V of this Special Provision to arrange for viewing the documents.\r\n \r\nD29899A - a29899 QUALITY PLAN WITH QUALITY ASSURANCE REVIEW BY DEPARTMENT - LOW BID \r\nDESIGN\r\nAddendum:4\r\nAssociated Item(s):\r\n----------------Page (33) Break----------------\r\nECMS Highway Construction Contract 31895\r\nJanuary 9, 2020 08:37:55 AMPage 85 of 319\r\n \r\nHeader:\r\nQuality Plan with Quality Assurance Review by Department - Low Bid Design\r\n \r\nProvision Body:\r\nI. DESCRIPTION - This item consists of developing, furnishing, executing, and maintaining a Quality Plan for the Design Activities \r\nlisted in Section IV of the Special Provision titled SPECIAL BIDDING – DESIGN-BUILD and establishing controls to ensure \r\ncompliance with all contract documents for those design activities. The Department and FHWA (as appropriate) will provide a \r\nQuality Assurance Review.\r\nII. DEFINITIONS.\r\na. Quality Plan – The plan prepared for managing quality during final plan development for Design Activities as identified in the \r\nSpecial Provision titled SPECIAL BIDDING – DESIGN-BUILD that addresses key staff, responsibilities, milestones, monitoring \r\nbudgets and schedules, communication efforts, Quality Control/Quality Assurance efforts and tracking procedures as a minimum. It \r\nshould include a detailed description of the Quality Control staff, design procedures, and design review procedures\r\nb. Quality Control (QC) – All processes and activities performed on the Contract to assess and control the accuracy and \r\ncompleteness of the design, to ensure Contract compliance.\r\nc. Quality Control Reviewer – The design consultant engineering firm or individuals that are responsible to manage the quality \r\ncontrol of the design-build contract, including the Quality Control Manager and the Alternate Quality Control Manager.\r\nd. Quality Control Staff – The design consultant team or individuals that are responsible to manage the quality control of the \r\ndesign-build Contract. The QC Staff includes the QC Manager, Alternate QC Manager, and sufficient number of qualified personnel \r\nto ensure Contract compliance. The QC Staff may include personnel from the same firm as the Lead Design Engineer, as defined \r\nin the Special Provision titled SPECIAL BIDDING – DESIGN-BUILD, but may not be involved with other design activities on the \r\ncontract.\r\ne. Quality Assurance (QA) - The planned and systematic actions that are necessary to provide adequate confidence that a \r\nproduct or facility complies with Federal and State requirements. QA is the performance of a high level review of each product to \r\nconfirm quality, economy, and compliance with Contract requirements.\r\nf. Quality Assurance (QA) Team - The Department and FHWA (as appropriate) representatives who check the validity of the \r\nQuality Plan to confirm that the work is done in accordance with the Contract documents.\r\ng. Quality Assurance Review - A review of the plans, specifications, and calculations by the Department and FHWA (as \r\nappropriate) to confirm that the project's approved design criteria are being followed.\r\nIII. QUALITY PLAN\r\n(a) Quality Plan Requirements.\r\n1. Quality Control Requirements. Identify and discuss the procedures that will be used to review, modify, and approve plan \r\ndocuments and associated permits. Include methods and procedures to control, document, and accept the quality of the design \r\nactivities listed in Section IV of the Special Provision titled SPECIAL BIDDING – DESIGN-BUILD. Include the following quality \r\ncontrol items as a minimum:\r\na. Control.\r\n(1) Procedures to control the quality of the final design.\r\n(2) Methodology used to determine design criteria to be used to develop design.\r\n(3) Proposed design criteria for design.\r\n(4) Guidelines for submission review including approach for addressing partial submissions.\r\n----------------Page (34) Break----------------\r\nECMS Highway Construction Contract 31895\r\nJanuary 9, 2020 08:37:55 AMPage 86 of 319\r\n(5) A general outline of the Lead Design Engineer's document control.\r\n(6) Copies of the Lead Design Engineer's quality control forms and/or checklists.\r\n(7) Incorporate design submission deadlines and Department review cycle-times into the CPM \r\nSchedule.\r\nb. Records.\r\n(1) Method of recording stages of design development.\r\n(2) System of maintaining a design submission/review/acceptance status log.\r\n(3) Method for updating and tracking submission status for all aspects of the design including partial \r\nsubmissions and permits.\r\n(4) Systems by which the Lead Design Engineer internally checks calculations and the Contract \r\ndocuments.\r\n(5) Records of submission reviews, approvals, and permits granted.\r\n(6) Records of design revisions during construction.\r\nc. Acceptance.\r\n(1) Procedures to obtain acceptance and construction release by the Department through Quality \r\nAssurance review.\r\n(2) Method of documenting and recording acceptance and construction release by the Department.\r\n2. Quality Control Staffing. Maintain the QC Staff at approved Quality Plan levels at all times until project completion. The Lead \r\nDesign Engineer Project Manager is responsible to review all design submissions, signing and sealing as appropriate, and then \r\nsubmit the design to the Department as defined in the Special Provision titled SPECIAL BIDDING – DESIGN-BUILD.\r\nProvide an organization chart showing lines of authority and contact information of the key staff of the Contractor, Lead Design \r\nEngineer, and the QC Staff.\r\nProvide the following information in the Quality Plan:\r\na. Lead Design Engineer. The Lead Design Engineer (LDE) consists of a Lead Design Engineer Project Manager and sufficient \r\ndesign personnel to ensure contract compliance. Lead Design Engineer personnel will report directly to the Lead Design Engineer \r\nProject Manager. The Lead Design Engineer Project Manager will report directly to the contractor. The Quality Plan must include, \r\nbut not be limited to, the following:\r\n(1) Provide an organization chart showing lines of authority and contact information of the Lead Design \r\nEngineer personnel.\r\n(2) Include resumes, qualifications, duties, responsibilities, and certifications, of all design personnel. \r\nProvide a letter from a principal of the Lead Design Engineer firm to the Lead Design Engineer Project \r\nManager that clearly describes their responsibilities and provide delegation of authority to stop work on \r\nany elements that do not comply with the contract documents.\r\n(3) Identify the Lead Design Engineer Project Manager. The Lead Design Engineer Project Manager \r\nmust meet the minimum requirement of being a Professional Engineer (PE) registered in the State with \r\na minimum of 7 years of experience managing and supervising the design of roadway and/or structure \r\nprojects.\r\n(4) Provide a letter from an authorized official of the Contractor to the Lead Design Engineer Project \r\nManager that clearly describes their responsibilities and provides delegation of authority to stop work \r\non any elements that do not comply with the Contract.\r\n----------------Page (35) Break----------------\r\nECMS Highway Construction Contract 31895\r\nJanuary 9, 2020 08:37:55 AMPage 87 of 319\r\nb. Quality Control Staff. The QC Staff consists of a QC Manager, Alternate QC Manager, and sufficient number of qualified \r\npersonnel to ensure Contract compliance. QC Staff personnel will report directly to the QC Manager. The QC Manager will report \r\ndirectly to the Contractor. The Quality Plan must include, but not be limited to, the following:\r\n(1) Provide an organization chart showing lines of authority and contact information of the Quality \r\nControl Staff personnel.\r\n(2) Include resumes, qualifications, duties, responsibilities, authorities, and certifications of all QC Staff \r\npersonnel.\r\n(3) Identify the QC Manager and Alternate QC Manager. The Alternate QC Manager is responsible to \r\nmanage the QC effort during periods when the QC Manager is absent. In no instance will the QC \r\nManager be absent from project responsibilities and the alternate manager serve for more than a \r\ncontinuous 2-week period without written permission from the Department.\r\n(4) The QC Manager and Alternate QC Manager must meet the minimum requirement of being a \r\nProfessional Engineer (PE) registered in the State with a minimum of 7 years of experience managing \r\nand supervising the design of roadway and/or structure projects.\r\n(5) Provide a letter from an authorized official of the Contractor to the QC Manager that clearly \r\ndescribes the responsibilities and delegates the authority to stop work on any elements that do not \r\ncomply with the Contract. The QC Manager will issue a letter of direction to all other Quality Control \r\nrepresentatives outlining duties, authorities, and responsibilities. Include copies of these letters in the \r\nQuality Plan.\r\n(b) Quality Plan Submittal. Clearly describe the approach to quality management and development of the Quality Plan. The \r\ndiscussion of the Quality Plan will address all activities listed in the Special Provision titled SPECIAL BIDDING – DESIGN-BUILD. \r\nDescribe in detail the plans, procedures, references, organization, and documents required to ensure that all work complies with \r\nContract documents. Include control measures, documentation procedures, records, and forms. Where Partial Submissions are \r\nallowed, address all specified partial submission requirements, list all partial submission components, and describe the schedule of \r\npartial submissions.\r\nSubmit the Quality Plan to the Department by the 5th working day after receiving approval of the QC Reviewer. The Department \r\nwill provide comments on the Quality Plan at the Quality Coordination Meeting.\r\n(c) Quality Coordination Meeting. Hold a Quality Coordination Meeting with the Department either as part of the pre-construction \r\nmeeting, or as a separate meeting, and discuss the Quality Plan. Attendance by the Contractor, QC Manager, Alternate QC \r\nManager, Lead Design Engineer, and the QA Team are mandatory at this meeting. The Department reserves the right to designate \r\nattendance by additional personnel. The meeting must be held within 10 working days following the date of the Notice to Proceed. \r\nDuring the meeting, a mutual agreement of the details to be included in the final Quality Plan will be developed including the forms \r\nfor recording the operations, control activities, administration of the Quality Plan, and the interrelationship of the Quality Plan. \r\nMinutes of the coordination meeting must be prepared by the Lead Design Engineer, signed by the Contractor and the \r\nDepartment, and recorded. The Quality Coordination Meeting minutes must be incorporated as part of the final Quality Plan.\r\n(d) Quality Plan Approval. Within 10 working days after the Quality Coordination Meeting, submit the final Quality Plan for \r\napproval based on comments received during the Quality Coordination Meeting. Include an updated CPM in the submission.\r\nNo payment will be made for design activities listed in Section IV of the Special Provision titled SPECIAL BIDDING – DESIGN-\r\nBUILD without an approved Quality Plan. Upon acceptance, the entire Quality Plan will become part of the Contract documents. \r\nOnce work begins under the approved Quality Plan, continuously evaluate the work in accordance with the Quality Plan. Do not \r\nimplement any changes without prior acceptance by the Department.\r\n(e) Design Activity Submissions Monthly Report. In addition to the records required by Section III(a)1.b of this Special \r\nProvision, maintain the status of all submissions associated with the design activities listed in Section IV of the Special Provision \r\ntitled SPECIAL BIDDING – DESIGN-BUILD on the form titled \"Design Activity Submissions Monthly Report.\" This form is located in \r\nECMS File Cabinet (in the References Tab). Submit this form within 30 calendar days following approval of the Quality Plan, and \r\nsubmit an updated version every 30 calendar days thereafter until the Final Drawings have been released for construction.\r\n(f) Quality Assurance Review. The Department and FHWA (as appropriate) will perform a QA review of the plans, specifications, \r\nand calculations to confirm that the Department's approved design criteria are being followed.\r\n----------------Page (36) Break----------------\r\nECMS Highway Construction Contract 31895\r\nJanuary 9, 2020 08:37:55 AMPage 88 of 319\r\nUpon successful completion of the QA review, the plans will be issued to the Contractor by letter by the Department identifying the \r\nspecific plans covered by the review. Plans issued will be stamped with the following statement:\r\n\"Quality Assurance Review was conducted. Released for Construction.\"\r\nUpon successful completion of QA review of partial submissions, where permitted in the Special Provisions, plans will be issued to \r\nthe Contractor by letter by the Department identifying the limitations of the review, and the limitations of the work released for \r\nconstruction. Plans issued will be stamped with the following statement:\r\n\"Quality Assurance Review was conducted. Released for Construction.\"\r\n(g) Infractions. Any infractions of the Contract requirements, which are not monitored sufficiently by the Lead Design Engineer \r\nand the QC Reviewer, will result in any and all payments related to design activities listed in the Special Provision titled SPECIAL \r\nBIDDING – DESIGN-BUILD being withheld until infractions are corrected.\r\nSuch action may result in the District Executive giving a written order for the dismissal and replacement of the Lead Design \r\nEngineer and/or the QC Reviewer. An extension of Contract time or request for additional costs will not be considered when a \r\ndelay or suspension occurs due to such infractions.\r\nBe advised that any deliberate omissions or deliberate cover-ups will be grounds for default of the Contract.\r\nIV. MEASUREMENT AND PAYMENT\r\nIncidental to the design activities listed in Section IV of the Special Provision titled SPECIAL BIDDING – DESIGN-BUILD.\r\n \r\n00 - a90001 WETLAND SPECIALIST OVERSIGHT\r\nAddendum:\r\nAssociated Item(s):\r\n \r\nHeader:\r\nWETLAND SPECIALIST OVERSIGHT\r\n \r\nProvision Body:\r\nAll planting and fine grading will be done in the presence of the Wetland Specialist. Notify the Wetland Specialist at least three (3) \r\nworking days prior to planting activities or fine grading.\r\nContact Information for Wetland Specialist:\r\nMr. Bruce Bayne\r\nAECOM\r\nE-mail: bruce.bayne@aecom.com\r\nPhone: 610-832-3581\r\n \r\nI54A - c00054 ITEM 9000-6170 – PORTLAND CEMENT CONCRETE PAVEMENT TRAINING\r\nAddendum:3\r\nAssociated Item(s):9000-6170\r\n \r\nHeader:\r\n----------------Page (37) Break----------------\r\nECMS Highway Construction Contract 31895\r\nJanuary 9, 2020 08:37:55 AMPage 89 of 319\r\nITEM 9000-6170 – PORTLAND CEMENT CONCRETE PAVEMENT TRAINING\r\n \r\nProvision Body:\r\nI.  DESCRIPTION - Just-in-time training (JIT2) is a formal class for the joint training of Contractors, Department \r\nemployees, their agents, subcontractors, and consultant inspectors that will be associated with the construction or \r\nrehabilitation of a Portland cement concrete pavement project.\r\n \r\nII.  MATERIAL-\r\n    (a)  SCOPE. Have the training include, but not limited to all of the following topics that are applicable to the project \r\nincluding: concrete pavement basics, pre-paving considerations, long-life concrete pavement concepts, materials, best \r\npractices for concrete pavement construction, monitoring standard and innovative paving equipment and operations, \r\nquality control, measurement and materials testing protocols and procedures, available tools and software for \r\nmonitoring work, and troubleshooting. \r\n    Use recognized concrete pavement best-practices and guidance documents in developing materials for use in this \r\ntraining class. These documents include, but are not limited to the following:\r\n·        Integrated Materials and Construction Practices for Concrete Pavements (FHWA Publication No. \r\nHIF-07-004),\r\n \r\n·        Concrete Pavement Field Reference Pre-Paving; (ACPA Publication EB237P),\r\n \r\n·        Concrete Pavement Field Reference Paving (ACPA Publication EB238P),\r\n \r\n·        Concrete Pavement Field Reference Preservation and Repair (ACPA Publication EB239P). \r\n    (b)  QUALIFICATIONS AND SUBMITTALS. At a minimum of 45 calendar days before the JIT2 pre-construction \r\nsession, submit to the Representative the name and qualifications of the instructor(s), and the JIT2 facility location. At \r\na minimum of 15 calendar days before the JIT2 pre-construction session, submit 1 copy each of any course handouts \r\nand presentation materials to the Representative.\r\n \r\nIII.  CONSTRUCTION-\r\n    (a)  REQUIREMENTS. Provide JIT2 instructor(s) experienced with the specified pavement specifications, \r\nconstruction methods, materials, material testing, and knowledgeable of best-practices in concrete pavement \r\ntechnologies.  The lead JIT2 instructor must be a Professional Engineer licensed in the State of Pennsylvania and  not \r\nan employee of the Contractor, the Department, or of any firms otherwise contractually obligated to perform work on \r\nthe project.\r\n    Conduct JIT2 during normal work hours.  Provide a facility, unless otherwise agreed to by the Representative, that \r\ncan accommodate at least 40 individuals and is within 5 miles of the job site or at a mutually agreed upon location.\r\n        1.  The following personnel are required to attend the JIT2:\r\n----------------Page (38) Break----------------\r\nECMS Highway Construction Contract 31895\r\nJanuary 9, 2020 08:37:55 AMPage 90 of 319\r\n·        Representing the Contractor: The paving superintendent; paving foreman; paver mechanic or operator; \r\npaving crew; concrete plant technician; sawing and sealing representatives; concrete and other materials \r\nsupplier representatives; surveyors; personnel responsible for managing, controlling, or operating standard \r\nand innovative construction or testing equipment; subcontractors involved with concrete pavement work; \r\nand any other key construction personnel associated with this project.\r\n·        Representing the Department: The Assistant Construction Engineer, Inspector-In-Charge, DME/DMM, \r\nconcrete plant inspector, main office pavement/construction staff, and key inspection assistants including \r\nconsultant inspection staff associated with this project.\r\n·        Any other personnel deemed necessary by the Department or the JIT2 instructor.\r\n        2.  The JIT2 must meet the following requirements:\r\n·        A 4-hour to 6-hour pre-construction session conducted after approval of the concrete pavement QC plan \r\nand no more than 1 month before the start of concrete pavement work. The session will cover all aspects of \r\nthe concrete pavement specifications and the work methods, equipment, and materials that are proposed \r\nfor use.\r\n·        A 2-hour follow-up session conducted approximately 3 work days after the actual start of concrete \r\npavement work; those attending the pre-construction training session should attend this follow-up session.\r\n·        A 2-hour session conducted before the start of all new construction seasons for those who have attended \r\nthe pre-construction and initial follow-up sessions and for any new personnel that have assumed project \r\nroles and responsibilities identified in Section III(a)1.\r\n·        At the Contractor’s option, JIT2 may be an extension of a pre-paving meeting or other regularly scheduled \r\nproject meeting.\r\n \r\nIV.     MEASUREMENT AND PAYMENT - Lump Sum\r\nPayment will be made as follows:\r\n·        75% after the conclusion of the pre-construction and initial follow-up session\r\n·        25% after the completion of all required training for new personnel and/or refresher sessions needed for \r\nadditional construction seasons\r\n \r\n \r\n \r\nI58A - c00058 ITEM 9000-7102 - DYNAMIC PILE LOAD TESTING\r\nAddendum:\r\nAssociated Item(s):9000-7102\r\n \r\nHeader:\r\nITEM 9000-7102 - DYNAMIC PILE LOAD TESTING\r\n \r\n----------------Page (39) Break----------------\r\nECMS Highway Construction Contract 31895\r\nJanuary 9, 2020 08:37:55 AMPage 91 of 319\r\nProvision Body:\r\nI. DESCRIPTION—This work is providing dynamic pile load testing and analyses. Conduct dynamic testing on the specified pile(s) \r\nat each substructure as indicated or as directed by the Representative.  Conduct dynamic testing during the entire length of piles \r\ndriven and during the time piles are re-driven, if re-drive is specified.\r\n    The purpose of dynamic testing is to provide the Department with supplemental information for evaluating pile hammer \r\nperformance, driving stresses, potential pile damage and bearing capacities.\r\nII. MATERIAL—Provide dynamic pile load testing with equipment and accessories conforming to the requirements of ASTM \r\nD4945-12. The same hammer and equipment must be used for the dynamic pile load testing on the test piles and/or production \r\npiles.\r\nIII. CONSTRUCTION—\r\n    (a)  Qualifications.  Perform the dynamic testing with a Professional Engineer and workforce experienced in dynamic testing \r\nmeeting the following qualifications and submitting proper documentation:\r\n•The dynamic testing operator must have a minimum of 3 years of experience that demonstrates successful performance on \r\nat least three projects in similar geotechnical conditions and pile type with the use of high-strain dynamic pile testing. \r\nInclude a brief description of each project and the name and phone number of the owner’s representative knowledgeable in \r\neach project listed.\r\n•Furnish the full name and license number of a Professional Engineer registered in the State, having at least 5 years of \r\nexperience in the performance of dynamic testing of driven piles, who is responsible for the work performed and preparing \r\ntest reports.\r\n    Do not use only the company names of consultants or manufacturers to meet the requirements of this section; use the names of \r\nthe personnel.\r\n    Submit documentation of staff qualifications to the Representative and allow at least 21 calendar days for approval.\r\n    Do not start dynamic testing before obtaining approval by the Representative.\r\n    (b)  Submittals.  Submit proposed methods of documentation and reports to the Representative for approval. Include the format \r\nof the electronic template for the submission of pile driving records.\r\n    Deliver to the Representative the printed output records from the dynamic pile load testing with data to correlate the records with \r\nthe respective pile and driving records as the tests are completed. Supply this information to the Representative within 24 hours of \r\ntesting. Record all signals on approved electronic media.\r\n    Perform supplementary office analyses on pile(s) dynamically tested, as directed by the Representative, which exhibit unusual \r\nfield conditions.  Include an interpretive report that summarizes pertinent field data, to determine pile tip elevations, pile capacity, \r\nsoil resistance distribution, dynamic soil properties of shaft and toe quake and damping resistances, and driving stresses \r\nthroughout the pile for each substructure unit. Evaluate and report the pile capacity versus plan factored axial resistances, \r\nmaximum measured driving stress at absolute refusal, hammer system efficiency, and pile structural damage/integrity. Submit a \r\npreliminary report within 48 hours of dynamic pile load testing.\r\n    Submit a complete report with the information outlined in ASTM D4945-12, signed and sealed by a Professional Engineer \r\nlicensed in the State, to the Representative within 5 days of testing.\r\n    (c)  Dynamic Pile Load Testing.  Perform dynamic pile load testing only when the Representative is present for witnessing \r\nduring the entire time piles are driven or re-driven. Notify the Representative of a tentative schedule for testing at least 21 calendar \r\ndays before starting the tests. Notify the Representative of a firm date at least 48 hours before starting the tests, but give the notice \r\nbetween start of work on Monday and noon of the following Friday. Do not schedule dynamic testing on Saturdays, Sundays, or \r\nHolidays without prior approval from the Representative.\r\n    Perform dynamic testing as defined in ASTM D4945-12. Drill the necessary holes in the pile to fasten a pair of transducers and a \r\npair of accelerometers. Drive the pile while testing until ordered to stop by the Representative. Remove the transducers and \r\naccelerometers after the dynamic testing is completed. Submit a repair scheme to the Representative, for acceptance, to seal \r\ndrilled holes of the pile if that section is to be used for the substructure.\r\n----------------Page (40) Break----------------\r\nECMS Highway Construction Contract 31895\r\nJanuary 9, 2020 08:37:55 AMPage 92 of 319\r\nIV. MEASUREMENT AND PAYMENT—Each\r\n    Applies when dynamic testing is performed while driving the entire length of pile, including re-drive when specified.\r\n    All associated costs of furnishing dynamic testing services and equipment, tools, labor, and work necessary to conduct the \r\ndynamic pile load testing and to provide the data and results specified are incidental to this item.\r\n    The number of piles dynamically tested may be revised by the Representative due to subsurface conditions or due to hammer \r\nperformance.\r\n    No extra time or payment will be made for the following:\r\n•Testing that is unable to be completed or is terminated by the Contractor prior to driving the entire length of the pile as \r\ndetermined by the Representative.\r\n•Work determined by the Representative to be unsatisfactory due to improper driving methods, inadequate equipment and \r\nmaterials, or unacceptable splice or tip welding.\r\n•Cost for interruptions, delays, time lost due to malfunction, breakdown of equipment, or inclement weather.\r\n•Any additional testing done without the prior approval of the Representative.\r\n•All costs associated with replacing a hammer rejected due to unacceptable performance, inadequate capacity based on the \r\ndynamic pile load testing results, or if the Contractor should choose to replace an already accepted hammer.  These costs \r\ninclude, but are not limited to, transporting the replacement hammer to the job site, unloading and setup, additional \r\nanalyses and submissions, additional dynamic pile load tests required for the replacement hammer acceptance, lost \r\nproduction time, etc. Prior to driving any piles with the new hammer, the Contractor must submit the operating specifications \r\nand Pile Hammer Data sheet (CS-5 form) in order to request a WEAP analysis for acceptance of the proposed hammer; \r\nfollowing the same submission process and procedural process for acceptance as was required for the original hammer.\r\n \r\n \r\n \r\nD1070B - c01070 ITEM 8910-0001 - PERMITS FOR DESIGN-BUILD PROJECTS\r\nAddendum:\r\nAssociated Item(s):8910-0001\r\n \r\nHeader:\r\nITEM 8910-0001 - PERMITS FOR DESIGN-BUILD PROJECTS\r\n \r\nProvision Body:\r\nI. DESCRIPTION -This work is the preparation of and obtaining approval for all permits necessary to construct the project as \r\nindicated in the contract documents and signed Final Design Drawings.\r\nII. DESIGN –\r\n(a) Department-obtained permits. The following permits have been obtained by the Department for construction of this project:\r\n•US Army Corps of Engineers Section 404 Permit\r\n•PA DEP Water Obstruction and Encroachment Permit 105/404\r\n•PA DEP PAG-02 General NPDES Permit for Stormwater Discharges Associated with Construction Activities\r\n•PA DEP Earth Disturbance Permit (Section 102)\r\n•PA DEP Section 401 Water Quality Certification\r\n----------------Page (41) Break----------------\r\nECMS Highway Construction Contract 31895\r\nJanuary 9, 2020 08:37:55 AMPage 93 of 319\r\n(b) General. Obtain the following permits for construction of this project:\r\n•None\r\nAll permits must comply with Environmental Commitments and Mitigation Measures.\r\nThe following documents are attached (FOR INFORMATION ONLY) to facilitate the preparation of the permit submissions:\r\n•Drainage and Storm Water Management Hydraulic Computations\r\n•Hydrologic and Hydraulic Report\r\n•Erosion and Sediment Pollution Control Plan\r\n•Storm Water Management Plan\r\nThe approved Categorical Exclusion Evaluation is available on the Department’s CE/EA Expert System.\r\nIII. MEASUREMENT AND PAYMENT – Lump Sum.\r\nPartial payment will be made for the design activity based on the approved Schedule of Values in accordance with Section IX of \r\nthe Special Provision titled SPECIAL BIDDING – DESIGN-BUILD, utilizing the following components:\r\n•NPDES Permit Application Initial Submission\r\n•NPDES Permit Issuance\r\n•Waterway Permit Application Initial Submission\r\n•Waterway Permit Issuance\r\n \r\nI2032C - c02032 ITEM 9203-X101 - TEMPORARY EXCAVATION SUPPORT AND PROTECTION SYSTEM\r\nAddendum:3\r\nAssociated Item(s):9203-0101, 9203-1101, 9203-2101, 9203-3101\r\n \r\nHeader:\r\nITEM 9203-0101 TEMPORARY EXCAVATION SUPPORT AND PROTECTION SYSTEM \r\nITEM 9203-1101 TEMPORARY EXCAVATION SUPPORT AND PROTECTION SYSTEM \r\nITEM 9203-2101 TEMPORARY EXCAVATION SUPPORT AND PROTECTION SYSTEM \r\nITEM 9203-3101 TEMPORARY EXCAVATION SUPPORT AND PROTECTION SYSTEM\r\n \r\nProvision Body:\r\nI. DESCRIPTION - This work is the design and construction of a temporary excavation support and protection system or \r\nappropriately designed open cut excavation, as indicated, with a service life of less than or equal to 36 months.\r\nII. MATERIAL - Provide certification or laboratory test results verifying material properties. For used steel, the salvage design \r\nvalues from AASHTO Guide Design Specification for Bridge Temporary Works (AASHTO Guide Spec) may be used as an \r\nalternate to testing to determine grade of steel. Materials need not be new but must be in serviceable condition as determined by \r\nthe Engineer. Temporary material used does not have to be from a Bulletin 15 source, but must meet the following:\r\n•Structural Steel....................AASHTO M 270M/270 (ASTM A709M/A709) Grade 250(Grade 36),\r\nGrade 345(Grade 50) or Grade 345W(Grade 50W)\r\n•Steel Sheet Piling......... ......ASTM A328M/A328, ASTM A572M/A572\r\n•Steel H-Piles............... .......AASHTO M 270M/270 (ASTM A709M/A709), Grade 250(Grade 36)\r\n•Wood Lagging................. ...Rough Cut Species in AASHTO Guide Spec\r\nAppendix A and AASHTO Construction Handbook for Bridge Temporary\r\nWorks Appendix C\r\n----------------Page (42) Break----------------\r\nECMS Highway Construction Contract 31895\r\nJanuary 9, 2020 08:37:55 AMPage 94 of 319\r\n•Cement.............................AASHTO M85 and AASHTO M240\r\n•Pre-Stressing Steel......... .ASTM A416 Grade 270\r\n•Welded Wire Fabric......... ..AASHTO A55 (ASTM A185)\r\n•Reinforcement Bars....... ....AASHTO M 31M/31 (ASTM A615M/A615), AASHTO M42M/M42\r\n(ASTMA616M/A616),Grade420(Grade 60)\r\n•Other Material.....................In accordance with applicable Sections of Publication 408\r\nIII. DESIGN - Design the temporary excavation support and protection system in accordance with current AASHTO LRFD Bridge \r\nDesign Specifications and Design Manual, Part 4 (Metric) Specifications, current FHWA guidelines and AASHTO Guide Spec. \r\nDesign temporary excavation support and protection system for final condition and all construction conditions, including surcharge \r\nloads due to vehicle traffic and construction equipment. Submit 4 sets of design calculations and 4 sets of completed detailed \r\ndrawings, signed and sealed by a Professional Engineer, registered in the Commonwealth of Pennsylvania to the District \r\nExecutive for review. Include in the design calculations all material properties, design loads, and design assumptions. Include on \r\nthe completed detailed drawings all design dimensions, limits of work, elevations, material, member sizes and construction \r\nsequence. Provide cutoff elevation of steel and wooden components for work in streambed. Include specific installation procedures \r\nand testing requirements as part of the submittal. Allow 14 days for the review by the Department.\r\nEnsure that temporary excavation support and protection system design and construction conforms to the following:\r\na) Open cut excavations are allowed, provided they meet OSHA requirements, the safety of the traveling public, the approved \r\ntraffic control plan and existing structure is assured, and they stay within the legal right-of-way lines. Cuts can extend beyond legal \r\nright-of-way lines only with the written approval of the Department and written permission of the property owners. Ensure \r\nenvironmental compliance if cut extends beyond area cleared by the Department. Submit slope stability analysis in accordance \r\nwith Publication 293.\r\nb) The temporary excavation support and protection system will be selected by the Contractor. Examples include anchored walls, \r\nmechanically stabilized earth walls, prefabricated modular walls, cantilever walls, cofferdams, and soil nailing walls. These systems \r\nmay be comprised of one or more of the following: Soldier Piles, Timber Lagging, Steel Sheet Piling, Caissons, Slurry Walls, \r\nTiebacks, Soil Nails, Shotcrete, Deadman Anchors, Wales, Cross lot Bracing, Raker Braces, Precast Concrete, Precast Lagging, \r\nSoil Cement Lagging, Cement Bentonite, Gabions, Minipiles, Concrete Reaction Blocks, Mechanically Stabilized Earth Walls or \r\nother methods.\r\nc) Design temporary excavation support and protection system based on the following parameters:\r\n1. Soil parameters ( see Project Specific Details for following parameters):\r\n1.a Effective angle of friction ______________\r\n1.b Moist unit weight of soil ________________\r\n1.c Saturated unit weight of soil ____________\r\n1.d Effective cohesion _______________\r\n1.e Static groundwater level at elevation ______________\r\n1.f Undrained shear strength of cohesive soil___________\r\n1.g Shear strength for rock mass_____________________\r\nProvide other soil/rock properties with test data, needed in the design of the temporary excavation support and protection system.\r\n2. Ensure that all components stay within the legal right-of-way unless an easement is obtained by the Contractor.\r\nIV. CONSTRUCTION - Install temporary excavation support and protection system in accordance with applicable sections of \r\nPublication 408. Be responsible for adequacy, safety and compliance with Traffic Control Plan. If the design is not compliant with \r\nthe approved Traffic Control Plan, furnish any additional traffic control devices at no additional cost to the Department. All steel and \r\n----------------Page (43) Break----------------\r\nECMS Highway Construction Contract 31895\r\nJanuary 9, 2020 08:37:55 AMPage 95 of 319\r\nwooden components may remain in place to pavement subgrade or 0.6 meters(2 feet) below finish grade,whichever is higher \r\nelevation. Treated wood is not required unless it is within 2 meters(6 feet) of finish grade and is to remain in place. Pressure treat \r\nwith chromate copper arsenate (CCA) to refusal. Finish grade is defined as top of pavement when a roadway is behind the \r\ntemporary excavation support and protection system. Have a Professional Engineer, registered in the Commonwealth of \r\nPennsylvania, certify that the temporary excavation support system or open cut excavation has been installed as shown on the \r\nProfessional Engineer's signed and sealed drawings. Submit the certification to the Representative within 3 working days of \r\ncompletion of the system.\r\nV. QUALIFICATIONS - The work must be supervised by a superintendent or foreman who is experienced, in the construction of \r\ntemporary excavation support and protection system proposed. If the design height of the temporary excavation support and \r\nprotection system exceeds 6 meters(20 feet), provide the following with the design submission:\r\n•For the superintendent or foreman who will supervise the work, submit a list containing at least 5 projects which \r\ndemonstrate a minimum of 3 years experience in the construction of the temporary excavation support and protection \r\nsystem proposed. Include a brief description of each project and the name and phone number of the owner's representative \r\nknowledgeable in each project listed.\r\n•The name of the Professional Engineer, registered in the Commonwealth of Pennsylvania and having at least 3 years \r\nexperience in the design and construction of temporary excavation support and protection systems, who will design and \r\nspecify the sequence of construction of the temporary excavation support and protection of system.\r\nVI. MEASUREMENT AND PAYMENT - Lump Sum.\r\nThis item will be measured and paid for in a proportionate manner, designated by the Department.\r\nIf an acceptable open cut excavation is provided in lieu of the temporary excavation support indicated, payment will be made for \r\nthe as-bid lump sum temporary excavation support item, but no additional payment will be made for any class of excavation, \r\nstructure backfill or additional shoring as a result of the open cut excavation or to restore the facilities to their original condition.\r\n \r\nProject Specific Details:\r\nThe Soil Parameters as indicated in III. (c) 1. for Item 9203-0101 are:\r\n1.a Effective angle of friction: 26 degrees\r\n1.b Moist unit weight of soil: 120 pcf\r\n1.c Saturated unit weight of soil: 125 pcf\r\n1.d Effective cohesion: 0 psf\r\n1.e Static groundwater level at elevation: Abutment 1 - 917.00 Abutment 2 - 908.00\r\n1.f Undrained shear strength of cohesive soil: N/A\r\n1.g shear strength of rock mass: 1.0 TSF Claystone / 11 TSF Siltstone / 15 TSF Shale / 22 TSF Sandstone\r\nThe Soil Parameters as indicated in III. (c) 1. for Item 9203-1101 are:\r\n1.a Effective angle of friction: 25 degrees\r\n1.b Moist unit weight of soil: 125 pcf\r\n1.c Saturated unit weight of soil: 130 pcf\r\n1.d Effective cohesion: N/A\r\n1.e Static groundwater level at elevation: Varies\r\n1.f Undrained shear strength of cohesive soil: N/A\r\n1.g shear strength of rock mass: 2 TSF Claystone / 5 TSF Siltstone / 4 TSF Shale / 5 TSF Sandstone\r\nThe Soil Parameters as indicated in III. (c) 1. for Item 9203-2101 are:\r\n1.a Effective angle of friction: 26 degrees\r\n1.b Moist unit weight of soil: 120 pcf\r\n1.c Saturated unit weight of soil: 125 pcf\r\n1.d Effective cohesion: 0 psf\r\n1.e Static groundwater level at elevation: 973.1 ft.\r\n1.f Undrained shear strength of cohesive soil: 0 psf\r\n1.g shear strength of rock mass: 1.0 TSF\r\nThe Soil Parameters as indicated in III. (c) 1. for Item 9203-3101 are:\r\n----------------Page (44) Break----------------\r\nECMS Highway Construction Contract 31895\r\nJanuary 9, 2020 08:37:55 AMPage 96 of 319\r\n1.a Effective angle of friction: 26 degrees\r\n1.b Moist unit weight of soil: 105 pcf\r\n1.c Saturated unit weight of soil: 110 pcf\r\n1.d Effective cohesion: 0 psf\r\n1.e Static groundwater level at elevation: Abutment 1 - 926.00-927.50 Abutment 2 - 927.00-928.00\r\n1.f Undrained shear strength of cohesive soil: N/A\r\n1.g shear strength of rock mass: 0.5 TSF\r\nUtilize the following soil parameters for new structure backfill:\r\n1.a Effective angle of friction: 33 degrees\r\n1.b Moist unit weight of soil: 120 pcf\r\n1.c Saturated unit weight of soil: 135 pcf\r\n1.d Effective cohesion: N/A\r\n1.e Static groundwater level at elevation: Varies\r\n1.f Undrained shear strength of cohesive soil: N/A\r\n1.g Shear strength of rock mass: Varies by location (Refer to the values above)\r\n \r\nI6091H - c06091 ITEM 0609-0009 EQUIPMENT PACKAGE\r\nAddendum:\r\nAssociated Item(s):0609-0009\r\n \r\nHeader:\r\nITEM 0609-0009 EQUIPMENT PACKAGE\r\n \r\nProvision Body:\r\nAppendix\r\nTable A\r\nEQUIPMENT PACKAGE\r\nEquipmentQuantity\r\nCommunications Equipment\r\nHigh Capacity Multifunctional Device (MFD) (1)1\r\nLow Capacity Multifunctional Device (MFD) (1)0\r\nCellular Phone(s)13\r\nSpecialized Equipment\r\nSurveyor's Level & Measuring Rod0\r\nElectronic Digitizer1\r\nDigital Display Level1\r\nInfrared Thermometer1\r\nLaser Range Finder1\r\nPaper Shredder1\r\n----------------Page (45) Break----------------\r\nECMS Highway Construction Contract 31895\r\nJanuary 9, 2020 08:37:55 AMPage 97 of 319\r\nDigital Camera1\r\nInternet Service\r\nInternet Service ProviderYes\r\nWireless Internet Broadband Router (2)Yes\r\nMiscellaneous Items\r\nComputer MediaYes\r\nHigh yield MFD Ink/Toners CartridgesYes\r\nLaboratory Equipment\r\nConcrete Cylinder Testing Machine\r\n1. Unless otherwise approved, a MFD must be furnished in lieu of a separate copier, laser printer, color printer, scanner, and fax.\r\n2. Provide compatible, powered internet hardware with firewall protection capable of wireless WPA2 security internet service and \r\neight hardwired network ports, and pre-shared key. All cabling needed to interconnect network hardware and all microcomputer \r\nsystems are required.\r\nMicrocomputer Systems. A total of 0 microcomputer systems are estimated to be used on the project.\r\nThis information is being provided to assist Bidders in meeting the requirements of Section 609.2(c), Communications Equipment, \r\nSection 609.2(e), Internet Service, and Section 609.2(f), Miscellaneous Materials.\r\nMicrocomputer systems may be furnished by the Department. If microcomputer systems are to be furnished by the Contractor, as \r\npart of the construction Contract, the bid will include applicable, 0688-XXXX bid items. When indicated, furnish microcomputer \r\nsystems meeting the requirements of Section 688.\r\n \r\nI10051B - c10051 ITEM 9005-0500, 9005-2500, 9005-3500 - MANDATORY PRE-DRILLING FOR DRIVEN \r\nPILES\r\nAddendum:\r\nAssociated Item(s):9005-0500, 9005-2500, 9005-3500\r\n \r\nHeader:\r\nITEM 9005-0500 - MANDATORY PRE-DRILLING FOR DRIVEN PILES\r\nITEM 9005-2500 - MANDATORY PRE-DRILLING FOR DRIVEN PILES\r\nITEM 9005-3500 - MANDATORY PRE-DRILLING FOR DRIVEN PILES\r\n \r\nProvision Body:\r\nI. DESCRIPTION - This work is the mandatory drilling, augering, or boring of holes for indicated bearing piles and test piles at \r\nabutments and piers to the estimated pile tip elevations as shown on the plans.\r\nPre-drilled holes, commonly referred to as Open Holes, allow for the successful penetration of the pile tip to the specified elevation \r\nupon driving. It is not essential that the entire length of the pre-drilled hole be visible for the hole to be considered an Open Hole. \r\nPiles installed in pre-drilled holes must be driven/seated to ensure that the pile is not bearing on sloughed material.\r\nII. MATERIAL -\r\n(a) Aggregate - Section 703.1 or AASHTO No. 10 as specified in Section 703.2 Table C.\r\n----------------Page (46) Break----------------\r\nECMS Highway Construction Contract 31895\r\nJanuary 9, 2020 08:37:55 AMPage 98 of 319\r\n(b) Casing Pipe - Section 1006.2(a).\r\nIII. CONSTRUCTION -\r\n(a) General.\r\n•Drill holes at pile locations and to depths and intended bearing strata as shown on the plans. Deviations of drill hole from \r\nplan location and verticality are allowed, provided the driven pile is as specified in Sections 1005.3(b)2 and 1005.3(b)3.\r\n•For non-integral abutments, drill a hole with a minimum diameter 3 inches larger than the largest cross sectional dimension \r\nof the pile. For integral abutments, drill a hole with a minimum diameter that is the larger of 2 feet or 10 inches larger than \r\nthe largest cross section dimension of the pile.\r\n•Unless otherwise specified, casing is not required for a pre-drilled hole to be maintained as an Open Hole for pile insertion.\r\n•Casing is required to maintain an Open Hole for the following conditions:\r\n◦If there is evidence of exchange of soils or materials between adjacent pre-drilled holes.\r\n◦If drilling methods compromise the lateral support provided by the soil surrounding the pile due to excessive \r\nloss or migration of material.\r\n◦If excessive sloughing of material occurs into the pre-drilled hole such that infilling of the pre-drilled hole is \r\nvisible and evident at the surface.\r\n•The use of casing is recommended for pre-drilled holes influenced by groundwater.\r\n(b) Piles Driven without the Use of Casing.\r\n•The length of the pre-drilled hole is to remain open and unobstructed to allow insertion of the pile and aggregate, and to \r\nmaintain adequate lateral support for the installed pile. An incidental amount of material, which can be penetrated by the \r\npile during driving, may slough into the bottom of the hole.\r\n•Place pile in an Open Hole. For pre-drilled lengths less than 20 feet backfilling the hole with aggregate before placing the \r\npile is optional. Ensure the pile achieves the specified pre-drilled length as a minimum.\r\n•Backfill Open Hole with aggregate before driving pile. Minimize the potential for sloughing and collapse of the hole by \r\ninstalling the pile and aggregate or simply aggregate (if the pre-drilled length is less than 20 feet and approved by the \r\nRepresentative) in pre-drilled holes promptly after pre-drilling. The pile must reach the bottom of the pre-drilled hole and \r\nminimum pile tip elevation.\r\n•Ensure the pile achieves the specified pre-drilled length as a minimum.\r\n•Drive piles as specified in Section 1005.\r\n(c) Piles Driven with the Use of Casing.\r\n•Install casing as required to maintain an Open Hole.\r\n•Based on site conditions and project specifications, utilize either Option A or Option B below to complete the construction \r\nsequence, unless otherwise specified.\r\nOption AOption B\r\n•Place pile in an Open Hole. For pre-drilled lengths less \r\nthan 20 feet, backfilling the hole with aggregate before \r\nplacing the pile is optional. Ensure the pile achieves the \r\nspecified pre-drilled length as a minimum.\r\n•Backfill Open Hole with aggregate.\r\n----------------Page (47) Break----------------\r\nECMS Highway Construction Contract 31895\r\nJanuary 9, 2020 08:37:55 AMPage 99 of 319\r\n•Backfill Open Hole with aggregate.•Remove casing after backfilling operations.\r\n•Drive piles as specified in Section 1005.•Place pile in a backfilled Open Hole. Ensure the pile \r\nachieves the specified pre-drilled length as a minimum.\r\n•Remove casing after driving operation.•Drive piles as specified in Section 1005.\r\nIV. MEASUREMENT AND PAYMENT - Linear Foot\r\nMeasured from the bottom of the hole elevation to the bottom of the footing elevation. Includes mobilization, access to the \r\nfoundations, drilling, maintaining an Open Hole, casing and backfilling with aggregate.\r\nPiles and the pre-drilling of piles that reach absolute refusal (for point and end bearing piles) or end of driving criteria (for friction \r\npiles) above the pre-drilled elevation are unsatisfactorily driven and payment will not be made for these piles.\r\n \r\nI10052C - c10052 ITEM 9005-0600 PREDRILLING FOR UNFORESEEN OBSTRUCTIONS, EARTH \r\nDRILLING\r\nAddendum:\r\nAssociated Item(s):9005-0600\r\n \r\nHeader:\r\nITEM 9005-0600 PRE-DRILLING FOR UNFORESEEN OBSTRUCTIONS, EARTH DRILLING\r\n \r\nProvision Body:\r\nI. DESCRIPTION - This work is the pre-drilling of holes for piles that cannot be advanced to the predetermined tip elevation due to \r\nunforeseen obstructions; includes the extraction and re-driving of piles that cannot be advanced to the predetermined tip elevation \r\ndue to unforeseen obstructions. Re-driving occurs only after pre-drilling for unforeseen obstructions.\r\n(a) Earth Drilling. Drilling accomplished with conventional tools such as conventional earth augers to advance through soil, gravel, \r\nsand or other material except obstructions. The use of a spud is not allowed in lieu of earth drilling.\r\n(b) Obstruction Drilling. Drilling which requires the use of special rock augers, core barrels, boulder breakers, spuds, chisels or \r\nair tools to advance through cobbles, boulders, rock or any other natural or manmade objects.\r\n(c) Pile Extraction. Extraction of a pile, that could not be advanced to the predetermined tip elevation due to unforeseen \r\nobstructions, using vibratory hammer, cranes or other methods.\r\n(d) Re-driving. Driving a pile as specified in Section 1005 after pile is placed in a pre-drilled hole.\r\n(e) Open-Hole. Pre-drilled holes, commonly referred to as Open Holes, allow for the successful penetration of the pile to the \r\nspecified pile tip elevation upon re-driving. It is not essential that the entire length of the pre-drilled hole be visible for the hole to be \r\nconsidered an Open Hole. Piles installed in pre-drilled holes must be re-driven/seated to ensure that the pile is not bearing on \r\nsloughed material.\r\nII. MATERIAL -\r\n(a) Aggregate - Section 703.1 or AASHTO No. 10 as specified in Section 703.2 Table C.\r\n(b) Casing Pipe - Section 1006.2(a)\r\n----------------Page (48) Break----------------\r\nECMS Highway Construction Contract 31895\r\nJanuary 9, 2020 08:37:55 AMPage 100 of 319\r\nIII. CONSTRUCTION -\r\n(a) General.\r\n•As directed by the Engineer, extract piles that cannot be advanced to the predetermined tip elevations.\r\n•Inspect piles for damage.\r\n•Obtain Engineer's approval to reuse previously extracted piles. Discard damaged piles. Payment will not be made for piles \r\nor portions of piles that are not able to be reused.\r\n•For non-integral abutments, drill a hole with a minimum diameter 3 inches larger than the largest cross sectional dimension \r\nof the pile. For integral abutments, drill a hole with a minimum diameter that is the larger of 2 feet or 10 inches larger than \r\nthe largest cross sectional dimension of the pile. Deviations of drill hole from plan location and verticality are allowed, \r\nprovided the re-driven pile meets Sections 1005.3(b)2 and 1005.3(b)3.\r\n•Unless otherwise specified, casing is not required for a pre-drilled hole to be maintained as an Open Hole for pile insertion.\r\n•Casing is required to maintain an Open Hole for the following conditions:\r\n◦If there is evidence of exchange of soils or materials between adjacent pre-drilled holes.\r\n◦If drilling methods compromise the lateral support provided by the soil surrounding the pile due to excessive loss or \r\nmigration of material.\r\n◦If excessive sloughing of material occurs into the pre-drilled hole such that infilling of the pre-drilled hole is visible and \r\nevident at the surface.\r\n•The use of casing is recommended for pre-drilled holes influenced by groundwater.\r\n(b) Piles Driven without the Use of Casing.\r\n•The length of the pre-drilled hole is to remain open and unobstructed to allow insertion of the pile and aggregate, and to \r\nmaintain adequate lateral support for the installed pile. An incidental amount of material, which can be penetrated by the pile \r\nduring driving, may slough into the bottom of the hole.\r\n•Place pile in an Open Hole. For pre-drilled lengths less than 20 feet, backfilling the hole with aggregate before placing the \r\npile is optional. Ensure the pile achieves the specified pre-drilled length as a minimum.\r\n•Backfill Open Hole with aggregate before driving pile. Minimize the potential for sloughing and collapse of the hole by \r\ninstalling the pile and aggregate, or simply aggregate (if the pre-drilled length is less than 20 feet and approved by the \r\nRepresentative) in pre-drilled holes promptly after pre-drilling. The pile must reach the bottom of the pre-drilled hole and \r\nminimum pile tip elevation.\r\n•Ensure the pile achieves the specified pre-drilled length as a minimum.\r\n•Re-drive piles as specified in Section I(d).\r\n(c) Piles Driven with the Use of Casing.\r\n•Install casing as required to maintain an Open Hole.\r\n•Based on site conditions and project specifications, utilize either Option A or Option B below to complete the construction \r\nsequence, unless otherwise specified.\r\nOption AOption B\r\n•Place pile in an Open Hole. For pre-drilled lengths less \r\nthan 20 feet, backfilling the hole with aggregate before \r\n•Backfill Open Hole with aggregate.\r\n----------------Page (49) Break----------------\r\n",
    "summary": "This is a Pennsylvania Department of Transportation highway construction contract (ECMS 31895) for a design-build project involving multiple utilities, railroad coordination, environmental commitments, and complex construction and design activities. The contract includes detailed provisions on DBE participation, erosion control, insurance requirements, utility coordination, railroad protective services, dynamic pile load testing, and quality assurance processes. Strict timelines and liquidated damages apply for traffic lane openings and ramp reconstructions. The contract mandates a comprehensive Quality Plan and compliance with Right-to-Know Law. Risks include financial penalties for delays, legal risks from compliance failures, and performance risks related to utility and railroad coordination. Critical clauses emphasize DBE substitution approvals, liquidated damages, design firm eligibility, RTKL compliance, and quality control.",
    "usage": {
      "inputTokens": 33269,
      "outputTokens": 2032,
      "totalTokens": 35301
    },
    "documentId": "doc_1745863637852_291",
    "structuredData": {
      "documentType": "Contract",
      "title": "ECMS Highway Construction Contract 31895",
      "parties": [
        {
          "name": "Pennsylvania Department of Transportation",
          "role": "Owner"
        },
        {
          "name": "Contractor",
          "role": "Contractor"
        },
        {
          "name": "Omega Rail Management",
          "role": "Railroad Representative"
        },
        {
          "name": "West Penn Power",
          "role": "Utility"
        },
        {
          "name": "DQE Communications",
          "role": "Utility"
        },
        {
          "name": "Comcast",
          "role": "Utility"
        },
        {
          "name": "Laurel Highlands Telephone Company (LHTC)",
          "role": "Utility"
        },
        {
          "name": "Peoples Gas",
          "role": "Utility"
        },
        {
          "name": "Alliance Petroleum",
          "role": "Utility"
        },
        {
          "name": "MAWC – Water",
          "role": "Utility"
        },
        {
          "name": "MAWC – Sanitary Sewer",
          "role": "Utility"
        },
        {
          "name": "Verizon",
          "role": "Utility"
        },
        {
          "name": "SK Operating",
          "role": "Utility"
        }
      ],
      "dates": {
        "effective": "2020-01-09T08:37:55",
        "termination": null,
        "other": [
          {
            "name": "Pre-bid Conference",
            "date": "2019-10-24T09:30:00"
          },
          {
            "name": "Utility Anticipated Completion Dates",
            "date": "2019-12-31"
          },
          {
            "name": "DQE Communications Anticipated Completion",
            "date": "2020-01-10"
          },
          {
            "name": "Comcast Anticipated Completion",
            "date": "2020-01-24"
          },
          {
            "name": "MAWC Water Anticipated Completion",
            "date": "2020-03-30"
          }
        ]
      },
      "financialTerms": {
        "totalAmount": null,
        "currency": "USD",
        "paymentSchedule": "Payments made in accordance with Section 110.05 and Schedule of Values for lump sum items; progress payments monthly entered into ECMS; liquidated damages deducted from money due.",
        "penalties": "Road User Liquidated Damages (RULD) assessed for traffic restrictions with specified daily/hourly rates ranging from $500 to $10,000 depending on violation; penalties deducted from money due."
      },
      "keyObligations": [
        "Contractor must comply with Good Faith Effort (GFE) review process for DBE substitutions and maintain records for DBE/SBE payments for 3 years.",
        "Contractor must obtain prior approval before performing DBE or SBE work included in substitution requests.",
        "Contractor must cooperate with utility companies for relocation and protection of utilities, providing notifications as required.",
        "Contractor must maintain Railroad Protective Public Liability Insurance and provide certificates prior to work on railroad right-of-way.",
        "Contractor must comply with erosion and sediment pollution control plans and obtain necessary approvals before starting work.",
        "Contractor must submit and maintain a Quality Plan for design activities and comply with Quality Assurance reviews by Department and FHWA.",
        "Contractor must conduct dynamic pile load testing with qualified personnel and submit reports as specified.",
        "Contractor must comply with environmental commitments and mitigation tracking system (ECMTS) requirements.",
        "Contractor must attend pre-bid conference and conduct Portland Cement Concrete Pavement Training (JIT2) as specified.",
        "Contractor must notify Inspector-in-Charge prior to traffic barrier installation and obtain authorization before installation.",
        "Contractor must design and construct temporary excavation support systems in accordance with specifications and submit certified designs.",
        "Contractor must comply with Right-to-Know Law provisions and assist Department with information requests."
      ],
      "terminationConditions": [
        "Failure to carry required insurance until work is substantially completed constitutes contract violation and may lead to remedies under Section 108.08.",
        "Non-compliance with DBE/SBE participation requirements and failure to maintain records may result in contract penalties.",
        "Deliberate omissions or cover-ups in Quality Plan or design activities may result in contract default.",
        "Failure to obtain required approvals within specified review times will not result in contract time extensions or price adjustments.",
        "Contractor may be disallowed from performing design work if firms do not meet qualification requirements or violate conflict of interest provisions.",
        "Failure to provide requested information under Right-to-Know Law indemnifies Department against damages and penalties."
      ],
      "governingLaw": "Pennsylvania",
      "riskAssessment": {
        "overall": "Medium",
        "financialRisks": [
          {
            "description": "Assessment of liquidated damages for traffic restrictions and delays.",
            "severity": "High",
            "likelihood": "Medium"
          },
          {
            "description": "Costs associated with railroad protective services and utility relocations billed to Contractor.",
            "severity": "Medium",
            "likelihood": "Medium"
          }
        ],
        "legalRisks": [
          {
            "description": "Compliance with Right-to-Know Law and potential indemnity for failure to provide requested information.",
            "severity": "High",
            "likelihood": "Low"
          },
          {
            "description": "Organizational conflict of interest restrictions on design firms; non-compliance may lead to disallowance.",
            "severity": "Medium",
            "likelihood": "Medium"
          }
        ],
        "performanceRisks": [
          {
            "description": "Failure to meet DBE participation goals and Good Faith Effort requirements.",
            "severity": "Medium",
            "likelihood": "Medium"
          },
          {
            "description": "Delays in utility relocations or railroad protective services causing project delays.",
            "severity": "Medium",
            "likelihood": "Medium"
          },
          {
            "description": "Non-compliance with environmental commitments and erosion control plans.",
            "severity": "Medium",
            "likelihood": "Low"
          }
        ],
        "terminationRisks": [
          {
            "description": "Contract violation due to failure to maintain required insurance coverage.",
            "severity": "High",
            "likelihood": "Low"
          },
          {
            "description": "Contract default due to deliberate omissions or cover-ups in quality control or design activities.",
            "severity": "High",
            "likelihood": "Low"
          }
        ],
        "complianceRisks": [
          {
            "description": "Failure to comply with environmental permits and mitigation measures.",
            "severity": "Medium",
            "likelihood": "Low"
          },
          {
            "description": "Non-compliance with design submission and review schedules leading to delays and no time extensions.",
            "severity": "Medium",
            "likelihood": "Medium"
          }
        ]
      },
      "criticalClauses": [
        {
          "clause": "Good Faith Effort (GFE) Review and DBE Substitution Approval",
          "concern": "Contractor must obtain prior approval before performing substituted DBE work; failure may result in shortfalls and penalties.",
          "recommendation": "Ensure timely and thorough submission of GFE documentation and maintain communication with Department and IRT."
        },
        {
          "clause": "Road User Liquidated Damages (RULD)",
          "concern": "Strict traffic lane opening deadlines with substantial daily/hourly penalties for non-compliance.",
          "recommendation": "Implement rigorous project scheduling and monitoring to avoid delays triggering liquidated damages."
        },
        {
          "clause": "Professional Services Involvement Restrictions",
          "concern": "Design firms involved in bid package preparation are restricted from performing design work; non-compliance may lead to disallowance.",
          "recommendation": "Verify all design firms' eligibility and submit required disclosures promptly to avoid disqualification."
        },
        {
          "clause": "Right-to-Know Law Compliance",
          "concern": "Contractor must assist Department with information requests and indemnify Department for failures.",
          "recommendation": "Designate a legal contact and establish procedures to respond promptly to RTKL requests."
        },
        {
          "clause": "Quality Plan with Quality Assurance Review",
          "concern": "No payment for design activities without approved Quality Plan; infractions may withhold payments or cause dismissal of key personnel.",
          "recommendation": "Develop comprehensive Quality Plan, maintain QC staffing, and ensure full compliance with contract requirements."
        }
      ],
      "extractedContent": {
        "summary": "This is a Pennsylvania Department of Transportation highway construction contract (ECMS 31895) for a design-build project involving multiple utilities, railroad coordination, environmental commitments, and complex construction and design activities. The contract includes detailed provisions on DBE participation, erosion control, insurance requirements, utility coordination, railroad protective services, dynamic pile load testing, and quality assurance processes. Strict timelines and liquidated damages apply for traffic lane openings and ramp reconstructions. The contract mandates a comprehensive Quality Plan and compliance with Right-to-Know Law. Risks include financial penalties for delays, legal risks from compliance failures, and performance risks related to utility and railroad coordination. Critical clauses emphasize DBE substitution approvals, liquidated damages, design firm eligibility, RTKL compliance, and quality control."
      }
    }
  }
}